<!-- terraform cdk action for options with hash ea4e3265923454c20a9e9049fa7b0805 -->
### ✅ Successfully applied Terraform CDK Stack 'cdktf'



<details><summary>Show Run</summary>

```shell
cdktf  Initializing HCP Terraform...
cdktf  Initializing modules...
cdktf  Downloading registry.terraform.io/oracle-terraform-modules/vcn/oci 3.6.0 for oci0_oci0-base_vcn_D4433BAC...
cdktf  - oci0_oci0-base_vcn_D4433BAC in .terraform/modules/oci0_oci0-base_vcn_D4433BAC
cdktf  - oci0_oci0-base_vcn_D4433BAC.subnet in .terraform/modules/oci0_oci0-base_vcn_D4433BAC/modules/subnet
       Downloading registry.terraform.io/oracle-terraform-modules/vcn/oci 3.6.0 for oci1_oci1-base_vcn_51671EF0...
cdktf  - oci1_oci1-base_vcn_51671EF0 in .terraform/modules/oci1_oci1-base_vcn_51671EF0
cdktf  - oci1_oci1-base_vcn_51671EF0.subnet in .terraform/modules/oci1_oci1-base_vcn_51671EF0/modules/subnet
       Downloading registry.terraform.io/oracle-terraform-modules/vcn/oci 3.6.0 for oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA...
cdktf  - oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA in .terraform/modules/oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA
cdktf  - oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.subnet in .terraform/modules/oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA/modules/subnet
       Downloading registry.terraform.io/oracle-terraform-modules/vcn/oci 3.6.0 for oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02...
cdktf  - oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02 in .terraform/modules/oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02
cdktf  - oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.subnet in .terraform/modules/oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02/modules/subnet
cdktf  Initializing provider plugins...
       - Finding hashicorp/random versions matching "3.6.3"...
cdktf  - Finding tailscale/tailscale versions matching "0.17.0"...
cdktf  - Finding cloudflare/cloudflare versions matching "4.41.0"...
cdktf  - Finding oracle/oci versions matching ">= 4.67.3, 6.9.0"...
cdktf  - Installing cloudflare/cloudflare v4.41.0...
cdktf  - Installed cloudflare/cloudflare v4.41.0 (self-signed, key ID C76001609EE3B136)
cdktf  - Installing oracle/oci v6.9.0...
cdktf  - Installed oracle/oci v6.9.0 (signed by a HashiCorp partner, key ID 1533A49284137CEB)
cdktf  - Installing hashicorp/random v3.6.3...
cdktf  - Installed hashicorp/random v3.6.3 (signed by HashiCorp)
cdktf  - Installing tailscale/tailscale v0.17.0...
cdktf  - Installed tailscale/tailscale v0.17.0 (self-signed, key ID 6B5A366F1FD32BD0)
       Partner and community providers are signed by their developers.
       If you'd like to know more about provider signing, you can read about it here:
       https://www.terraform.io/docs/cli/plugins/signing.html
       Terraform has created a lock file .terraform.lock.hcl to record the provider
       selections it made above. Include this file in your version control repository
       so that Terraform can guarantee to make the same selections by default when
       you run "terraform init" in the future.
cdktf  HCP Terraform has been successfully initialized!

       You may now begin working with HCP Terraform. Try running "terraform plan" to
       see any changes that are required for your infrastructure.

       If you ever set or change modules or Terraform Settings, run "terraform init"
       again to reinitialize your working directory.
cdktf  - Fetching tailscale/tailscale 0.17.0 for linux_amd64...
cdktf  - Retrieved tailscale/tailscale 0.17.0 for linux_amd64 (self-signed, key ID 6B5A366F1FD32BD0)
cdktf  - Fetching cloudflare/cloudflare 4.41.0 for linux_amd64...
cdktf  - Retrieved cloudflare/cloudflare 4.41.0 for linux_amd64 (self-signed, key ID C76001609EE3B136)
cdktf  - Fetching oracle/oci 6.9.0 for linux_amd64...
cdktf  - Retrieved oracle/oci 6.9.0 for linux_amd64 (signed by a HashiCorp partner, key ID 1533A49284137CEB)
cdktf  - Fetching hashicorp/random 3.6.3 for linux_amd64...
cdktf  - Retrieved hashicorp/random 3.6.3 for linux_amd64 (signed by HashiCorp)
       - Obtained tailscale/tailscale checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
       - Obtained cloudflare/cloudflare checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
       - Obtained oracle/oci checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
       - Obtained hashicorp/random checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
cdktf  Success! Terraform has validated the lock file and found no need for changes.
cdktf  Running apply in HCP Terraform. Output will stream here. Pressing Ctrl-C
       will cancel the remote apply if it's still pending. If the apply started it
       will stop streaming the logs, but will not stop the apply running remotely.

       Preparing the remote apply...
cdktf  To view this run in a browser, visit:
       https://app.terraform.io/app/jon77p-xyz/infrastructure/runs/run-Y4B7WL3WUeSyS3ZF
cdktf  Waiting for the plan to start...
cdktf  Terraform v1.9.5
       on linux_amd64
       Initializing plugins and modules...
cdktf  data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_2A981C6F (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones): Refreshing...
       data.cloudflare_zones.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_cf_zones_0B8286FB (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/cf_zones): Refreshing...
cdktf  data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_cf_zones_CA2BE853 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/cf_zones): Refreshing...
       data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_thepi_cloud_E25C89DE (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones_thepi_cloud): Refreshing...
       data.cloudflare_zones.oci1_oci1-vault-tunnel_cf_zones_4E15E863 (oci1/oci1/oci1-vault-tunnel/cf_zones): Refreshing...
       data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_cf_zones_CA2BE853 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/cf_zones): Refresh complete after 1s [id=26917df6062007ddfe496b5780dfddff]
cdktf  data.cloudflare_zones.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_cf_zones_0B8286FB (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/cf_zones): Refresh complete after 1s [id=26917df6062007ddfe496b5780dfddff]
cdktf  data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_2A981C6F (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones): Refresh complete after 1s [id=26917df6062007ddfe496b5780dfddff]
       data.cloudflare_zones.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_cf_zones_thepi_cloud_E25C89DE (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/cf_zones_thepi_cloud): Refresh complete after 2s [id=f64dd1d129b18dfb86637e568821ec50]
       data.cloudflare_zones.oci1_oci1-vault-tunnel_cf_zones_4E15E863 (oci1/oci1/oci1-vault-tunnel/cf_zones): Refresh complete after 2s [id=26917df6062007ddfe496b5780dfddff]
cdktf  Terraform used the selected providers to generate the following execution plan.
       Resource actions are indicated with the following symbols:
         + create
        <= read (data resources)

       Terraform will perform the following actions:
cdktf  # data.oci_core_boot_volumes.oci1_oci1-vault-compute_all_boot_volumes_C357A53D (oci1/oci1/oci1-vault-compute/all_boot_volumes) will be read during apply
        <= data "oci_core_boot_volumes" "oci1_oci1-vault-compute_all_boot_volumes_C357A53D" {
             + availability_domain = (known after apply)
             + boot_volumes        = (known after apply)
             + compartment_id      = (known after apply)
             + id                  = (known after apply)

             + filter {
                 + name   = "display_name"
                 + regex  = true
                 + values = [
                     + "vault",
                   ]
               }
             + filter {
                 + name   = "state"
                 + values = [
                     + "AVAILABLE",
                   ]
               }
           }

         # data.oci_core_boot_volumes.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_all_boot_volumes_0EC61C1F (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/all_boot_volumes) will be read during apply
        <= data "oci_core_boot_volumes" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_all_boot_volumes_0EC61C1F" {
             + availability_domain = (known after apply)
             + boot_volumes        = (known after apply)
             + compartment_id      = (known after apply)
             + id                  = (known after apply)

             + filter {
                 + name   = "display_name"
                 + regex  = true
                 + values = [
                     + "cicd",
                   ]
               }
             + filter {
                 + name   = "state"
                 + values = [
                     + "AVAILABLE",
                   ]
               }
           }

         # data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_all_boot_volumes_C3CB241A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/all_boot_volumes) will be read during apply
        <= data "oci_core_boot_volumes" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_all_boot_volumes_C3CB241A" {
             + availability_domain = (known after apply)
             + boot_volumes        = (known after apply)
             + compartment_id      = (known after apply)
             + id                  = (known after apply)

             + filter {
                 + name   = "display_name"
                 + regex  = true
                 + values = [
                     + "auth",
                   ]
               }
             + filter {
                 + name   = "state"
                 + values = [
                     + "AVAILABLE",
                   ]
               }
           }

         # data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_all_boot_volumes_98671A9E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/all_boot_volumes) will be read during apply
        <= data "oci_core_boot_volumes" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_all_boot_volumes_98671A9E" {
             + availability_domain = (known after apply)
             + boot_volumes        = (known after apply)
             + compartment_id      = (known after apply)
             + id                  = (known after apply)

             + filter {
                 + name   = "display_name"
                 + regex  = true
                 + values = [
                     + "healthchecks",
                   ]
               }
             + filter {
                 + name   = "state"
                 + values = [
                     + "AVAILABLE",
                   ]
               }
           }

         # data.oci_core_vcns.oci0_oci0-base_core_vcn_8F8E2055 (oci0/oci0/oci0-base/core_vcn) will be read during apply
        <= data "oci_core_vcns" "oci0_oci0-base_core_vcn_8F8E2055" {
             + compartment_id   = (known after apply)
             + display_name     = "terraform"
             + id               = (known after apply)
             + virtual_networks = (known after apply)
           }

         # data.oci_core_vcns.oci1_oci1-base_core_vcn_5A15CF74 (oci1/oci1/oci1-base/core_vcn) will be read during apply
        <= data "oci_core_vcns" "oci1_oci1-base_core_vcn_5A15CF74" {
             + compartment_id   = (known after apply)
             + display_name     = "terraform"
             + id               = (known after apply)
             + virtual_networks = (known after apply)
           }

         # data.oci_core_vcns.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_core_vcn_FC0CC604 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/core_vcn) will be read during apply
        <= data "oci_core_vcns" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_core_vcn_FC0CC604" {
             + compartment_id   = (known after apply)
             + display_name     = "terraform"
             + id               = (known after apply)
             + virtual_networks = (known after apply)
           }
cdktf  # data.oci_core_vcns.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_core_vcn_1C9F3188 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/core_vcn) will be read during apply
        <= data "oci_core_vcns" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_core_vcn_1C9F3188" {
             + compartment_id   = (known after apply)
             + display_name     = "terraform"
             + id               = (known after apply)
             + virtual_networks = (known after apply)
           }

         # data.oci_identity_availability_domain.oci1_oci1-vault-compute_ads_12D6B9C9 (oci1/oci1/oci1-vault-compute/ads) will be read during apply
        <= data "oci_identity_availability_domain" "oci1_oci1-vault-compute_ads_12D6B9C9" {
             + ad_number      = 1
             + compartment_id = (known after apply)
             + id             = (known after apply)
             + name           = (known after apply)
           }

         # data.oci_identity_availability_domain.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ads_A38EDF06 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ads) will be read during apply
        <= data "oci_identity_availability_domain" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ads_A38EDF06" {
             + ad_number      = 1
             + compartment_id = (known after apply)
             + id             = (known after apply)
             + name           = (known after apply)
           }

         # data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ads_7BD871F0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ads) will be read during apply
        <= data "oci_identity_availability_domain" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ads_7BD871F0" {
             + ad_number      = 1
             + compartment_id = (known after apply)
             + id             = (known after apply)
             + name           = (known after apply)
           }

         # data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ads_E0439301 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ads) will be read during apply
        <= data "oci_identity_availability_domain" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ads_E0439301" {
             + ad_number      = 1
             + compartment_id = (known after apply)
             + id             = (known after apply)
             + name           = (known after apply)
           }

         # cloudflare_record.oci1_oci1-vault-record_DD9AADE3 (oci1/oci1/oci1-vault-record) will be created
         + resource "cloudflare_record" "oci1_oci1-vault-record_DD9AADE3" {
             + allow_overwrite = false
             + content         = (known after apply)
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "vault.oci1.jon77p.xyz"
             + proxiable       = (known after apply)
             + proxied         = false
             + ttl             = (known after apply)
             + type            = "A"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci1_oci1-vault-tunnel_ingress_record_opconnect_jon77p_xyz_1B7A5737 (oci1/oci1/oci1-vault-tunnel/ingress_record_opconnect_jon77p_xyz) will be created
         + resource "cloudflare_record" "oci1_oci1-vault-tunnel_ingress_record_opconnect_jon77p_xyz_1B7A5737" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = "tunnel-vault.jon77p.xyz"
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "opconnect.jon77p.xyz"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci1_oci1-vault-tunnel_ingress_record_vault_jon77p_xyz_5D7A9265 (oci1/oci1/oci1-vault-tunnel/ingress_record_vault_jon77p_xyz) will be created
         + resource "cloudflare_record" "oci1_oci1-vault-tunnel_ingress_record_vault_jon77p_xyz_5D7A9265" {
             + allow_overwrite = false
cdktf  + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = "tunnel-vault.jon77p.xyz"
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "vault.jon77p.xyz"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci1_oci1-vault-tunnel_ssh_app_oci1-vault-tunnel_FE5AB979 (oci1/oci1/oci1-vault-tunnel/ssh_app_oci1-vault-tunnel) will be created
         + resource "cloudflare_record" "oci1_oci1-vault-tunnel_ssh_app_oci1-vault-tunnel_FE5AB979" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = "tunnel-vault.jon77p.xyz"
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "ssh-vault"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci1_oci1-vault-tunnel_tunnel_app_oci1-vault-tunnel_C7B9BEDE (oci1/oci1/oci1-vault-tunnel/tunnel_app_oci1-vault-tunnel) will be created
         + resource "cloudflare_record" "oci1_oci1-vault-tunnel_tunnel_app_oci1-vault-tunnel_C7B9BEDE" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = (known after apply)
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "tunnel-vault"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-record_0B972CEE (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-record) will be created
         + resource "cloudflare_record" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-record_0B972CEE" {
             + allow_overwrite = false
             + content         = (known after apply)
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "cicd.oci2-us-phoenix-1.jon77p.xyz"
             + proxiable       = (known after apply)
             + proxied         = false
             + ttl             = (known after apply)
             + type            = "A"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_oci2-us-phoenix-1-cicd-tunnel_EDF64A2C (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app_oci2-us-phoenix-1-cicd-tunnel) will be created
         + resource "cloudflare_record" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_oci2-us-phoenix-1-cicd-tunnel_EDF64A2C" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = "tunnel-cicd.jon77p.xyz"
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
cdktf  + name            = "ssh-cicd"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_app_oci2-us-phoenix-1-cicd-tunnel_B9119A9A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_app_oci2-us-phoenix-1-cicd-tunnel) will be created
         + resource "cloudflare_record" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_app_oci2-us-phoenix-1-cicd-tunnel_B9119A9A" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = (known after apply)
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "tunnel-cicd"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-record) will be created
         + resource "cloudflare_record" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0" {
             + allow_overwrite = false
             + content         = (known after apply)
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "auth.oci2-us-sanjose-1.jon77p.xyz"
             + proxiable       = (known after apply)
             + proxied         = false
             + ttl             = (known after apply)
             + type            = "A"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ingress_record_auth_jon77p_xyz_3D3EF4C0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ingress_record_auth_jon77p_xyz) will be created
         + resource "cloudflare_record" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ingress_record_auth_jon77p_xyz_3D3EF4C0" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = "tunnel-auth.jon77p.xyz"
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "auth.jon77p.xyz"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_oci2-us-sanjose-1-auth-tunnel_A298E943 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_app_oci2-us-sanjose-1-auth-tunnel) will be created
         + resource "cloudflare_record" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_oci2-us-sanjose-1-auth-tunnel_A298E943" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = "tunnel-auth.jon77p.xyz"
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "ssh-auth"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
cdktf  + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_app_oci2-us-sanjose-1-auth-tunnel_DC6BF9E8 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_app_oci2-us-sanjose-1-auth-tunnel) will be created
         + resource "cloudflare_record" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_app_oci2-us-sanjose-1-auth-tunnel_DC6BF9E8" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = (known after apply)
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "tunnel-auth"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-record) will be created
         + resource "cloudflare_record" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6" {
             + allow_overwrite = false
             + content         = (known after apply)
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "healthchecks.oci2-us-sanjose-1.jon77p.xyz"
             + proxiable       = (known after apply)
             + proxied         = false
             + ttl             = (known after apply)
             + type            = "A"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_jon77p_xyz_B4CBE9EA (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ingress_record_healthchecks_jon77p_xyz) will be created
         + resource "cloudflare_record" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_jon77p_xyz_B4CBE9EA" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = "tunnel-healthchecks.jon77p.xyz"
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "healthchecks.jon77p.xyz"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_thepi_cloud_6389B44E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ingress_record_healthchecks_thepi_cloud) will be created
         + resource "cloudflare_record" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_thepi_cloud_6389B44E" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = "tunnel-healthchecks.jon77p.xyz"
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "healthchecks.thepi.cloud"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
cdktf  + zone_id         = "bcd015486feab8e90475de6390e8b83f"
           }

         # cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_oci2-us-sanjose-1-healthchecks-tunnel_69E906E3 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_app_oci2-us-sanjose-1-healthchecks-tunnel) will be created
         + resource "cloudflare_record" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_oci2-us-sanjose-1-healthchecks-tunnel_69E906E3" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = "tunnel-healthchecks.jon77p.xyz"
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "ssh-healthchecks"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_app_oci2-us-sanjose-1-healthchecks-tunnel_3877712B (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_app_oci2-us-sanjose-1-healthchecks-tunnel) will be created
         + resource "cloudflare_record" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_app_oci2-us-sanjose-1-healthchecks-tunnel_3877712B" {
             + allow_overwrite = false
             + comment         = "Managed by cdktf. {tag=cdktf, repo=https://github.com/jon77p/infrastructure}"
             + content         = (known after apply)
             + created_on      = (known after apply)
             + hostname        = (known after apply)
             + id              = (known after apply)
             + metadata        = (known after apply)
             + modified_on     = (known after apply)
             + name            = "tunnel-healthchecks"
             + proxiable       = (known after apply)
             + proxied         = true
             + ttl             = (known after apply)
             + type            = "CNAME"
             + value           = (known after apply)
             + zone_id         = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_zero_trust_access_application.oci1_oci1-vault-tunnel_ssh_app_68D668B6 (oci1/oci1/oci1-vault-tunnel/ssh_app) will be created
         + resource "cloudflare_zero_trust_access_application" "oci1_oci1-vault-tunnel_ssh_app_68D668B6" {
             + account_id                   = (known after apply)
             + allowed_idps                 = [
                 + "5bf62a31-b558-4f66-8542-9263cfab24de",
               ]
             + app_launcher_visible         = false
             + aud                          = (known after apply)
             + auto_redirect_to_identity    = true
             + domain                       = "ssh-vault.jon77p.xyz"
             + enable_binding_cookie        = false
             + id                           = (known after apply)
             + name                         = "ssh-vault.jon77p.xyz"
             + options_preflight_bypass     = false
             + service_auth_401_redirect    = false
             + session_duration             = "24h"
             + skip_app_launcher_login_page = false
             + skip_interstitial            = true
             + type                         = "ssh"
             + zone_id                      = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_zero_trust_access_application.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_D8A92F3E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app) will be created
         + resource "cloudflare_zero_trust_access_application" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_D8A92F3E" {
             + account_id                   = (known after apply)
             + allowed_idps                 = [
                 + "5bf62a31-b558-4f66-8542-9263cfab24de",
               ]
             + app_launcher_visible         = false
             + aud                          = (known after apply)
             + auto_redirect_to_identity    = true
             + domain                       = "ssh-cicd.jon77p.xyz"
             + enable_binding_cookie        = false
             + id                           = (known after apply)
cdktf  + name                         = "ssh-cicd.jon77p.xyz"
             + options_preflight_bypass     = false
             + service_auth_401_redirect    = false
             + session_duration             = "24h"
             + skip_app_launcher_login_page = false
             + skip_interstitial            = true
             + type                         = "ssh"
             + zone_id                      = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_zero_trust_access_application.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_A26FBCE9 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_app) will be created
         + resource "cloudflare_zero_trust_access_application" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_A26FBCE9" {
             + account_id                   = (known after apply)
             + allowed_idps                 = [
                 + "5bf62a31-b558-4f66-8542-9263cfab24de",
               ]
             + app_launcher_visible         = false
             + aud                          = (known after apply)
             + auto_redirect_to_identity    = true
             + domain                       = "ssh-auth.jon77p.xyz"
             + enable_binding_cookie        = false
             + id                           = (known after apply)
             + name                         = "ssh-auth.jon77p.xyz"
             + options_preflight_bypass     = false
             + service_auth_401_redirect    = false
             + session_duration             = "24h"
             + skip_app_launcher_login_page = false
             + skip_interstitial            = true
             + type                         = "ssh"
             + zone_id                      = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_zero_trust_access_application.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_7271D789 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_app) will be created
         + resource "cloudflare_zero_trust_access_application" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_7271D789" {
             + account_id                   = (known after apply)
             + allowed_idps                 = [
                 + "5bf62a31-b558-4f66-8542-9263cfab24de",
               ]
             + app_launcher_visible         = false
             + aud                          = (known after apply)
             + auto_redirect_to_identity    = true
             + domain                       = "ssh-healthchecks.jon77p.xyz"
             + enable_binding_cookie        = false
             + id                           = (known after apply)
             + name                         = "ssh-healthchecks.jon77p.xyz"
             + options_preflight_bypass     = false
             + service_auth_401_redirect    = false
             + session_duration             = "24h"
             + skip_app_launcher_login_page = false
             + skip_interstitial            = true
             + type                         = "ssh"
             + zone_id                      = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_zero_trust_access_policy.oci1_oci1-vault-tunnel_ssh_policy_11AD3224 (oci1/oci1/oci1-vault-tunnel/ssh_policy) will be created
         + resource "cloudflare_zero_trust_access_policy" "oci1_oci1-vault-tunnel_ssh_policy_11AD3224" {
             + application_id = (known after apply)
             + decision       = "allow"
             + id             = (known after apply)
             + name           = "Policy for ssh-vault.jon77p.xyz"
             + precedence     = 2
             + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"

             + include {
                 + group = [
                     + "6a723869-ecbd-4685-b03a-dd0197601aeb",
                   ]
               }
           }

         # cloudflare_zero_trust_access_policy.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_policy_D05C6E16 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_policy) will be created
         + resource "cloudflare_zero_trust_access_policy" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_policy_D05C6E16" {
             + application_id = (known after apply)
             + decision       = "allow"
             + id             = (known after apply)
             + name           = "Policy for ssh-cicd.jon77p.xyz"
             + precedence     = 2
             + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"

             + include {
                 + group = [
                     + "6a723869-ecbd-4685-b03a-dd0197601aeb",
                   ]
               }
           }
cdktf  # cloudflare_zero_trust_access_policy.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_policy_AB9BEA0A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_policy) will be created
         + resource "cloudflare_zero_trust_access_policy" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_policy_AB9BEA0A" {
             + application_id = (known after apply)
             + decision       = "allow"
             + id             = (known after apply)
             + name           = "Policy for ssh-auth.jon77p.xyz"
             + precedence     = 2
             + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"

             + include {
                 + group = [
                     + "6a723869-ecbd-4685-b03a-dd0197601aeb",
                   ]
               }
           }

         # cloudflare_zero_trust_access_policy.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_policy_7BF7147D (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_policy) will be created
         + resource "cloudflare_zero_trust_access_policy" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_policy_7BF7147D" {
             + application_id = (known after apply)
             + decision       = "allow"
             + id             = (known after apply)
             + name           = "Policy for ssh-healthchecks.jon77p.xyz"
             + precedence     = 2
             + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"

             + include {
                 + group = [
                     + "6a723869-ecbd-4685-b03a-dd0197601aeb",
                   ]
               }
           }

         # cloudflare_zero_trust_access_short_lived_certificate.oci1_oci1-vault-tunnel_ssh_certificate_66EDB87A (oci1/oci1/oci1-vault-tunnel/ssh_certificate) will be created
         + resource "cloudflare_zero_trust_access_short_lived_certificate" "oci1_oci1-vault-tunnel_ssh_certificate_66EDB87A" {
             + account_id     = (known after apply)
             + application_id = (known after apply)
             + aud            = (known after apply)
             + id             = (known after apply)
             + public_key     = (known after apply)
             + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_certificate_E83230F5 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_certificate) will be created
         + resource "cloudflare_zero_trust_access_short_lived_certificate" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_certificate_E83230F5" {
             + account_id     = (known after apply)
             + application_id = (known after apply)
             + aud            = (known after apply)
             + id             = (known after apply)
             + public_key     = (known after apply)
             + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_certificate_9E655C25 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_certificate) will be created
         + resource "cloudflare_zero_trust_access_short_lived_certificate" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_certificate_9E655C25" {
             + account_id     = (known after apply)
             + application_id = (known after apply)
             + aud            = (known after apply)
             + id             = (known after apply)
             + public_key     = (known after apply)
             + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_certificate_C8A986EF (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_certificate) will be created
         + resource "cloudflare_zero_trust_access_short_lived_certificate" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_certificate_C8A986EF" {
             + account_id     = (known after apply)
             + application_id = (known after apply)
             + aud            = (known after apply)
             + id             = (known after apply)
             + public_key     = (known after apply)
             + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
           }

         # cloudflare_zero_trust_tunnel_cloudflared.oci1_oci1-vault-tunnel_tunnel_oci1-vault-tunnel_2066D201 (oci1/oci1/oci1-vault-tunnel/tunnel_oci1-vault-tunnel) will be created
         + resource "cloudflare_zero_trust_tunnel_cloudflared" "oci1_oci1-vault-tunnel_tunnel_oci1-vault-tunnel_2066D201" {
             + account_id   = (sensitive value)
             + cname        = (known after apply)
             + config_src   = "cloudflare"
             + id           = (known after apply)
cdktf  + name         = "vault"
             + secret       = (sensitive value)
             + tunnel_token = (sensitive value)
           }

         # cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_oci2-us-phoenix-1-cicd-tunnel_53FE648A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_oci2-us-phoenix-1-cicd-tunnel) will be created
         + resource "cloudflare_zero_trust_tunnel_cloudflared" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_oci2-us-phoenix-1-cicd-tunnel_53FE648A" {
             + account_id   = (sensitive value)
             + cname        = (known after apply)
             + config_src   = "cloudflare"
             + id           = (known after apply)
             + name         = "cicd"
             + secret       = (sensitive value)
             + tunnel_token = (sensitive value)
           }

         # cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_oci2-us-sanjose-1-auth-tunnel_FAA28023 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_oci2-us-sanjose-1-auth-tunnel) will be created
         + resource "cloudflare_zero_trust_tunnel_cloudflared" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_oci2-us-sanjose-1-auth-tunnel_FAA28023" {
             + account_id   = (sensitive value)
             + cname        = (known after apply)
             + config_src   = "cloudflare"
             + id           = (known after apply)
             + name         = "auth"
             + secret       = (sensitive value)
             + tunnel_token = (sensitive value)
           }

         # cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_oci2-us-sanjose-1-healthchecks-tunnel_36ADB018 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_oci2-us-sanjose-1-healthchecks-tunnel) will be created
         + resource "cloudflare_zero_trust_tunnel_cloudflared" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_oci2-us-sanjose-1-healthchecks-tunnel_36ADB018" {
             + account_id   = (sensitive value)
             + cname        = (known after apply)
             + config_src   = "cloudflare"
             + id           = (known after apply)
             + name         = "healthchecks"
             + secret       = (sensitive value)
             + tunnel_token = (sensitive value)
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910 (oci1/oci1/oci1-vault-tunnel/tunnel_config_oci1-vault-tunnel) will be created
         + resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910" {
             + account_id = (sensitive value)
             + id         = (known after apply)
             + tunnel_id  = (known after apply)

             + config {
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "ssh://vault:22"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/_healthcheck$"
                     + service  = "http_status:200"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/metrics$"
                     + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/ready$"
                     + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "hello-world"
                   }
                 + ingress_rule {
                     + hostname = "vault.jon77p.xyz"
                     + service  = "http://localhost:8200"
                   }
                 + ingress_rule {
                     + hostname = "opconnect.jon77p.xyz"
                     + service  = "http://localhost:8082"
                   }
                 + ingress_rule {
                     + service = "http_status:404"
                   }
                 + warp_routing {
                     + enabled = true
                   }
               }
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_config_oci2-us-phoenix-1-cicd-tunnel_82FEA1E0 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_config_oci2-us-phoenix-1-cicd-tunnel) will be created
         + resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_config_oci2-us-phoenix-1-cicd-tunnel_82FEA1E0" {
             + account_id = (sensitive value)
             + id         = (known after apply)
cdktf  + tunnel_id  = (known after apply)

             + config {
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "ssh://cicd:22"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/_healthcheck$"
                     + service  = "http_status:200"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/metrics$"
                     + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/ready$"
                     + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "hello-world"
                   }
                 + ingress_rule {
                     + service = "http_status:404"
                   }
                 + warp_routing {
                     + enabled = true
                   }
               }
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_config_oci2-us-sanjose-1-auth-tunnel) will be created
         + resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E" {
             + account_id = (sensitive value)
             + id         = (known after apply)
             + tunnel_id  = (known after apply)

             + config {
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "ssh://auth:22"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/_healthcheck$"
                     + service  = "http_status:200"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/metrics$"
                     + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/ready$"
                     + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "hello-world"
                   }
                 + ingress_rule {
                     + hostname = "auth.jon77p.xyz"
                     + service  = "http://localhost:9443"

                     + origin_request {
                         + connect_timeout          = "30s"
                         + disable_chunked_encoding = false
                         + http2_origin             = false
                         + keep_alive_connections   = 100
                         + keep_alive_timeout       = "1m30s"
                         + no_happy_eyeballs        = false
                         + no_tls_verify            = true
                         + proxy_address            = "127.0.0.1"
                         + proxy_port               = 0
                         + tcp_keep_alive           = "30s"
                         + tls_timeout              = "10s"
                       }
                   }
                 + ingress_rule {
                     + service = "http_status:404"
                   }
                 + warp_routing {
                     + enabled = true
                   }
               }
           }

         # cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel) will be created
         + resource "cloudflare_zero_trust_tunnel_cloudflared_config" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470" {
             + account_id = (sensitive value)
             + id         = (known after apply)
             + tunnel_id  = (known after apply)

             + config {
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "ssh://healthchecks:22"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/_healthcheck$"
                     + service  = "http_status:200"
                   }
                 + ingress_rule {
cdktf  + hostname = "*"
                     + path     = "^/metrics$"
                     + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = "*"
                     + path     = "^/ready$"
                     + service  = "http://localhost:2000"
                   }
                 + ingress_rule {
                     + hostname = (known after apply)
                     + service  = "hello-world"
                   }
                 + ingress_rule {
                     + hostname = "healthchecks.jon77p.xyz"
                     + service  = "http://localhost:8000"
                   }
                 + ingress_rule {
                     + hostname = "healthchecks.thepi.cloud"
                     + service  = "http://localhost:8000"
                   }
                 + ingress_rule {
                     + service = "http_status:404"
                   }
                 + warp_routing {
                     + enabled = true
                   }
               }
           }

         # oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance) will be created
         + resource "oci_core_instance" "oci1_oci1-vault-compute_ubuntu_instance_3E6E0388" {
             + availability_domain                 = (known after apply)
             + boot_volume_id                      = (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compartment_id                      = (known after apply)
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             + defined_tags                        = (known after apply)
             + display_name                        = "vault"
             + extended_metadata                   = (known after apply)
             + fault_domain                        = (known after apply)
             + freeform_tags                       = (known after apply)
             + hostname_label                      = (known after apply)
             + id                                  = (known after apply)
             + image                               = (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             + is_cross_numa_node                  = (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             + launch_mode                         = (known after apply)
             + metadata                            = (known after apply)
             + preserve_boot_volume                = true
             + private_ip                          = (known after apply)
             + public_ip                           = (known after apply)
             + region                              = (known after apply)
             + shape                               = "VM.Standard.E2.1.Micro"
             + state                               = (known after apply)
             + subnet_id                           = (known after apply)
             + system_tags                         = (known after apply)
             + time_created                        = (known after apply)
             + time_maintenance_reboot_due         = (known after apply)

             + agent_config (known after apply)

             + availability_config (known after apply)

             + create_vnic_details {
                 + assign_ipv6ip             = (known after apply)
                 + assign_private_dns_record = true
                 + assign_public_ip          = "true"
                 + defined_tags              = (known after apply)
                 + display_name              = (known after apply)
                 + freeform_tags             = (known after apply)
                 + hostname_label            = "vault"
                 + nsg_ids                   = (known after apply)
                 + private_ip                = (known after apply)
                 + skip_source_dest_check    = (known after apply)
                 + subnet_id                 = (known after apply)
                 + vlan_id                   = (known after apply)

                 + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             + instance_options (known after apply)

             + launch_options (known after apply)
cdktf  + launch_volume_attachments (known after apply)

             + platform_config (known after apply)

             + preemptible_instance_config (known after apply)

             + shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 + gpus                          = (known after apply)
                 + local_disk_description        = (known after apply)
                 + local_disks                   = (known after apply)
                 + local_disks_total_size_in_gbs = (known after apply)
                 + max_vnic_attachments          = (known after apply)
                 + memory_in_gbs                 = 1
                 + networking_bandwidth_in_gbps  = (known after apply)
                 + nvmes                         = (known after apply)
                 + ocpus                         = 1
                 + processor_description         = (known after apply)
                 + vcpus                         = (known after apply)
               }

             + source_details {
                 + boot_volume_size_in_gbs = (known after apply)
                 + boot_volume_vpus_per_gb = (known after apply)
                 + source_id               = (known after apply)
                 + source_type             = (known after apply)

                 + instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance) will be created
         + resource "oci_core_instance" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8" {
             + availability_domain                 = (known after apply)
             + boot_volume_id                      = (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compartment_id                      = (known after apply)
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             + defined_tags                        = (known after apply)
             + display_name                        = "cicd"
             + extended_metadata                   = (known after apply)
             + fault_domain                        = (known after apply)
             + freeform_tags                       = (known after apply)
             + hostname_label                      = (known after apply)
             + id                                  = (known after apply)
             + image                               = (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             + is_cross_numa_node                  = (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             + launch_mode                         = (known after apply)
             + metadata                            = (known after apply)
             + preserve_boot_volume                = true
             + private_ip                          = (known after apply)
             + public_ip                           = (known after apply)
             + region                              = (known after apply)
             + shape                               = "VM.Standard.A1.Flex"
             + state                               = (known after apply)
             + subnet_id                           = (known after apply)
             + system_tags                         = (known after apply)
             + time_created                        = (known after apply)
             + time_maintenance_reboot_due         = (known after apply)

             + agent_config (known after apply)

             + availability_config (known after apply)

             + create_vnic_details {
                 + assign_ipv6ip             = (known after apply)
                 + assign_private_dns_record = true
                 + assign_public_ip          = "true"
                 + defined_tags              = (known after apply)
                 + display_name              = (known after apply)
                 + freeform_tags             = (known after apply)
                 + hostname_label            = "cicd"
cdktf  + nsg_ids                   = (known after apply)
                 + private_ip                = (known after apply)
                 + skip_source_dest_check    = (known after apply)
                 + subnet_id                 = (known after apply)
                 + vlan_id                   = (known after apply)

                 + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             + instance_options (known after apply)

             + launch_options (known after apply)

             + launch_volume_attachments (known after apply)

             + platform_config (known after apply)

             + preemptible_instance_config (known after apply)

             + shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 + gpus                          = (known after apply)
                 + local_disk_description        = (known after apply)
                 + local_disks                   = (known after apply)
                 + local_disks_total_size_in_gbs = (known after apply)
                 + max_vnic_attachments          = (known after apply)
                 + memory_in_gbs                 = 24
                 + networking_bandwidth_in_gbps  = (known after apply)
                 + nvmes                         = (known after apply)
                 + ocpus                         = 4
                 + processor_description         = (known after apply)
                 + vcpus                         = (known after apply)
               }

             + source_details {
                 + boot_volume_size_in_gbs = (known after apply)
                 + boot_volume_vpus_per_gb = (known after apply)
                 + source_id               = (known after apply)
                 + source_type             = (known after apply)

                 + instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance) will be created
         + resource "oci_core_instance" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68" {
             + availability_domain                 = (known after apply)
             + boot_volume_id                      = (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compartment_id                      = (known after apply)
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             + defined_tags                        = (known after apply)
             + display_name                        = "auth"
             + extended_metadata                   = (known after apply)
             + fault_domain                        = (known after apply)
             + freeform_tags                       = (known after apply)
             + hostname_label                      = (known after apply)
             + id                                  = (known after apply)
             + image                               = (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             + is_cross_numa_node                  = (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             + launch_mode                         = (known after apply)
             + metadata                            = (known after apply)
             + preserve_boot_volume                = true
             + private_ip                          = (known after apply)
             + public_ip                           = (known after apply)
             + region                              = (known after apply)
             + shape                               = "VM.Standard.E2.1.Micro"
             + state                               = (known after apply)
             + subnet_id                           = (known after apply)
             + system_tags                         = (known after apply)
             + time_created                        = (known after apply)
             + time_maintenance_reboot_due         = (known after apply)

             + agent_config (known after apply)
cdktf  + availability_config (known after apply)

             + create_vnic_details {
                 + assign_ipv6ip             = (known after apply)
                 + assign_private_dns_record = true
                 + assign_public_ip          = "true"
                 + defined_tags              = (known after apply)
                 + display_name              = (known after apply)
                 + freeform_tags             = (known after apply)
                 + hostname_label            = "auth"
                 + nsg_ids                   = (known after apply)
                 + private_ip                = (known after apply)
                 + skip_source_dest_check    = (known after apply)
                 + subnet_id                 = (known after apply)
                 + vlan_id                   = (known after apply)

                 + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             + instance_options (known after apply)

             + launch_options (known after apply)

             + launch_volume_attachments (known after apply)

             + platform_config (known after apply)

             + preemptible_instance_config (known after apply)

             + shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 + gpus                          = (known after apply)
                 + local_disk_description        = (known after apply)
                 + local_disks                   = (known after apply)
                 + local_disks_total_size_in_gbs = (known after apply)
                 + max_vnic_attachments          = (known after apply)
                 + memory_in_gbs                 = 1
                 + networking_bandwidth_in_gbps  = (known after apply)
                 + nvmes                         = (known after apply)
                 + ocpus                         = 1
                 + processor_description         = (known after apply)
                 + vcpus                         = (known after apply)
               }

             + source_details {
                 + boot_volume_size_in_gbs = (known after apply)
                 + boot_volume_vpus_per_gb = (known after apply)
                 + source_id               = (known after apply)
                 + source_type             = (known after apply)

                 + instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance) will be created
         + resource "oci_core_instance" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A" {
             + availability_domain                 = (known after apply)
             + boot_volume_id                      = (known after apply)
             + capacity_reservation_id             = (known after apply)
             + compartment_id                      = (known after apply)
             + compute_cluster_id                  = (known after apply)
             + dedicated_vm_host_id                = (known after apply)
             + defined_tags                        = (known after apply)
             + display_name                        = "healthchecks"
             + extended_metadata                   = (known after apply)
             + fault_domain                        = (known after apply)
             + freeform_tags                       = (known after apply)
             + hostname_label                      = (known after apply)
             + id                                  = (known after apply)
             + image                               = (known after apply)
             + instance_configuration_id           = (known after apply)
             + ipxe_script                         = (known after apply)
             + is_cross_numa_node                  = (known after apply)
             + is_pv_encryption_in_transit_enabled = (known after apply)
             + launch_mode                         = (known after apply)
             + metadata                            = (known after apply)
             + preserve_boot_volume                = true
             + private_ip                          = (known after apply)
             + public_ip                           = (known after apply)
cdktf  + region                              = (known after apply)
             + shape                               = "VM.Standard.E2.1.Micro"
             + state                               = (known after apply)
             + subnet_id                           = (known after apply)
             + system_tags                         = (known after apply)
             + time_created                        = (known after apply)
             + time_maintenance_reboot_due         = (known after apply)

             + agent_config (known after apply)

             + availability_config (known after apply)

             + create_vnic_details {
                 + assign_ipv6ip             = (known after apply)
                 + assign_private_dns_record = true
                 + assign_public_ip          = "true"
                 + defined_tags              = (known after apply)
                 + display_name              = (known after apply)
                 + freeform_tags             = (known after apply)
                 + hostname_label            = "healthchecks"
                 + nsg_ids                   = (known after apply)
                 + private_ip                = (known after apply)
                 + skip_source_dest_check    = (known after apply)
                 + subnet_id                 = (known after apply)
                 + vlan_id                   = (known after apply)

                 + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
               }

             + instance_options (known after apply)

             + launch_options (known after apply)

             + launch_volume_attachments (known after apply)

             + platform_config (known after apply)

             + preemptible_instance_config (known after apply)

             + shape_config {
                 + baseline_ocpu_utilization     = (known after apply)
                 + gpu_description               = (known after apply)
                 + gpus                          = (known after apply)
                 + local_disk_description        = (known after apply)
                 + local_disks                   = (known after apply)
                 + local_disks_total_size_in_gbs = (known after apply)
                 + max_vnic_attachments          = (known after apply)
                 + memory_in_gbs                 = 1
                 + networking_bandwidth_in_gbps  = (known after apply)
                 + nvmes                         = (known after apply)
                 + ocpus                         = 1
                 + processor_description         = (known after apply)
                 + vcpus                         = (known after apply)
               }

             + source_details {
                 + boot_volume_size_in_gbs = (known after apply)
                 + boot_volume_vpus_per_gb = (known after apply)
                 + source_id               = (known after apply)
                 + source_type             = (known after apply)

                 + instance_source_image_filter_details (known after apply)
               }
           }

         # oci_core_security_list.oci0_oci0-base_security_list_3B303AEE (oci0/oci0/oci0-base/security_list) will be created
         + resource "oci_core_security_list" "oci0_oci0-base_security_list_3B303AEE" {
             + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "terraform"
             + freeform_tags  = (known after apply)
             + id             = (known after apply)
             + state          = (known after apply)
             + time_created   = (known after apply)
             + vcn_id         = (known after apply)

             + egress_security_rules {
                 + description      = "Allows all traffic for all ports"
                 + destination      = "0.0.0.0/0"
                 + destination_type = (known after apply)
                 + protocol         = "all"
                 + stateless        = (known after apply)
               }

             + ingress_security_rules {
                 + description = "Allow SSH inbound"
                 + protocol    = "6"
                 + source      = "0.0.0.0/0"
                 + source_type = (known after apply)
                 + stateless   = false

                 + tcp_options {
                     + max = 22
                     + min = 22
                   }
               }
             + ingress_security_rules {
cdktf  + description = "Allows all TCP traffic for all ports for VCN subnet"
                 + protocol    = "6"
                 + source      = "10.0.0.0/16"
                 + source_type = (known after apply)
                 + stateless   = false
               }
             + ingress_security_rules {
                 + description = "ICMP traffic for: 3 Destination Unreachable"
                 + protocol    = "1"
                 + source      = "10.0.0.0/16"
                 + source_type = "CIDR_BLOCK"
                 + stateless   = false

                 + icmp_options {
                     + code = -1
                     + type = 3
                   }
               }
             + ingress_security_rules {
                 + description = "ICMP traffic for: 3, 4 Destination Unreachable: Fragmentation Needed and Don't Fragment was Set"
                 + protocol    = "1"
                 + source      = "10.0.0.0/16"
                 + source_type = "CIDR_BLOCK"
                 + stateless   = false

                 + icmp_options {
                     + code = 4
                     + type = 3
                   }
               }
           }

         # oci_core_security_list.oci1_oci1-base_security_list_86B45958 (oci1/oci1/oci1-base/security_list) will be created
         + resource "oci_core_security_list" "oci1_oci1-base_security_list_86B45958" {
             + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "terraform"
             + freeform_tags  = (known after apply)
             + id             = (known after apply)
             + state          = (known after apply)
             + time_created   = (known after apply)
             + vcn_id         = (known after apply)

             + egress_security_rules {
                 + description      = "Allows all traffic for all ports"
                 + destination      = "0.0.0.0/0"
                 + destination_type = (known after apply)
                 + protocol         = "all"
                 + stateless        = (known after apply)
               }

             + ingress_security_rules {
                 + description = "Allow SSH inbound"
                 + protocol    = "6"
                 + source      = "0.0.0.0/0"
                 + source_type = (known after apply)
                 + stateless   = false

                 + tcp_options {
                     + max = 22
                     + min = 22
                   }
               }
             + ingress_security_rules {
                 + description = "Allows all TCP traffic for all ports for VCN subnet"
                 + protocol    = "6"
                 + source      = "10.0.0.0/16"
                 + source_type = (known after apply)
                 + stateless   = false
               }
             + ingress_security_rules {
                 + description = "ICMP traffic for: 3 Destination Unreachable"
                 + protocol    = "1"
                 + source      = "10.0.0.0/16"
                 + source_type = "CIDR_BLOCK"
                 + stateless   = false

                 + icmp_options {
                     + code = -1
                     + type = 3
                   }
               }
             + ingress_security_rules {
                 + description = "ICMP traffic for: 3, 4 Destination Unreachable: Fragmentation Needed and Don't Fragment was Set"
                 + protocol    = "1"
                 + source      = "10.0.0.0/16"
                 + source_type = "CIDR_BLOCK"
                 + stateless   = false

                 + icmp_options {
                     + code = 4
                     + type = 3
                   }
               }
           }

         # oci_core_security_list.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_security_list_FC3DADC1 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/security_list) will be created
         + resource "oci_core_security_list" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_security_list_FC3DADC1" {
             + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "terraform"
             + freeform_tags  = (known after apply)
             + id             = (known after apply)
             + state          = (known after apply)
             + time_created   = (known after apply)
             + vcn_id         = (known after apply)

             + egress_security_rules {
                 + description      = "Allows all traffic for all ports"
                 + destination      = "0.0.0.0/0"
                 + destination_type = (known after apply)
                 + protocol         = "all"
                 + stateless        = (known after apply)
               }
cdktf  + ingress_security_rules {
                 + description = "Allow SSH inbound"
                 + protocol    = "6"
                 + source      = "0.0.0.0/0"
                 + source_type = (known after apply)
                 + stateless   = false

                 + tcp_options {
                     + max = 22
                     + min = 22
                   }
               }
             + ingress_security_rules {
                 + description = "Allows all TCP traffic for all ports for VCN subnet"
                 + protocol    = "6"
                 + source      = "10.0.0.0/16"
                 + source_type = (known after apply)
                 + stateless   = false
               }
             + ingress_security_rules {
                 + description = "ICMP traffic for: 3 Destination Unreachable"
                 + protocol    = "1"
                 + source      = "10.0.0.0/16"
                 + source_type = "CIDR_BLOCK"
                 + stateless   = false

                 + icmp_options {
                     + code = -1
                     + type = 3
                   }
               }
             + ingress_security_rules {
                 + description = "ICMP traffic for: 3, 4 Destination Unreachable: Fragmentation Needed and Don't Fragment was Set"
                 + protocol    = "1"
                 + source      = "10.0.0.0/16"
                 + source_type = "CIDR_BLOCK"
                 + stateless   = false

                 + icmp_options {
                     + code = 4
                     + type = 3
                   }
               }
           }

         # oci_core_security_list.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_security_list_26368F93 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/security_list) will be created
         + resource "oci_core_security_list" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_security_list_26368F93" {
             + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "terraform"
             + freeform_tags  = (known after apply)
             + id             = (known after apply)
             + state          = (known after apply)
             + time_created   = (known after apply)
             + vcn_id         = (known after apply)

             + egress_security_rules {
                 + description      = "Allows all traffic for all ports"
                 + destination      = "0.0.0.0/0"
                 + destination_type = (known after apply)
                 + protocol         = "all"
                 + stateless        = (known after apply)
               }

             + ingress_security_rules {
                 + description = "Allow SSH inbound"
                 + protocol    = "6"
                 + source      = "0.0.0.0/0"
                 + source_type = (known after apply)
                 + stateless   = false

                 + tcp_options {
                     + max = 22
                     + min = 22
                   }
               }
             + ingress_security_rules {
                 + description = "Allows all TCP traffic for all ports for VCN subnet"
                 + protocol    = "6"
                 + source      = "10.0.0.0/16"
                 + source_type = (known after apply)
                 + stateless   = false
               }
             + ingress_security_rules {
                 + description = "ICMP traffic for: 3 Destination Unreachable"
                 + protocol    = "1"
                 + source      = "10.0.0.0/16"
                 + source_type = "CIDR_BLOCK"
                 + stateless   = false

                 + icmp_options {
                     + code = -1
                     + type = 3
                   }
               }
             + ingress_security_rules {
                 + description = "ICMP traffic for: 3, 4 Destination Unreachable: Fragmentation Needed and Don't Fragment was Set"
                 + protocol    = "1"
                 + source      = "10.0.0.0/16"
                 + source_type = "CIDR_BLOCK"
                 + stateless   = false

                 + icmp_options {
                     + code = 4
                     + type = 3
                   }
               }
           }

         # oci_core_subnet.oci0_oci0-base_private_3EAB705B (oci0/oci0/oci0-base/private) will be created
         + resource "oci_core_subnet" "oci0_oci0-base_private_3EAB705B" {
             + availability_domain        = (known after apply)
             + cidr_block                 = "10.0.1.0/24"
             + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + dhcp_options_id            = (known after apply)
cdktf  + display_name               = "private"
             + dns_label                  = "private"
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + ipv6cidr_block             = (known after apply)
             + ipv6cidr_blocks            = (known after apply)
             + ipv6virtual_router_ip      = (known after apply)
             + prohibit_internet_ingress  = true
             + prohibit_public_ip_on_vnic = true
             + route_table_id             = (known after apply)
             + security_list_ids          = (known after apply)
             + state                      = (known after apply)
             + subnet_domain_name         = (known after apply)
             + time_created               = (known after apply)
             + vcn_id                     = (known after apply)
             + virtual_router_ip          = (known after apply)
             + virtual_router_mac         = (known after apply)
           }

         # oci_core_subnet.oci0_oci0-base_public_F5847813 (oci0/oci0/oci0-base/public) will be created
         + resource "oci_core_subnet" "oci0_oci0-base_public_F5847813" {
             + availability_domain        = (known after apply)
             + cidr_block                 = "10.0.0.0/24"
             + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + dhcp_options_id            = (known after apply)
             + display_name               = "public"
             + dns_label                  = "public"
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + ipv6cidr_block             = (known after apply)
             + ipv6cidr_blocks            = (known after apply)
             + ipv6virtual_router_ip      = (known after apply)
             + prohibit_internet_ingress  = false
             + prohibit_public_ip_on_vnic = false
             + route_table_id             = (known after apply)
             + security_list_ids          = (known after apply)
             + state                      = (known after apply)
             + subnet_domain_name         = (known after apply)
             + time_created               = (known after apply)
             + vcn_id                     = (known after apply)
             + virtual_router_ip          = (known after apply)
             + virtual_router_mac         = (known after apply)
           }

         # oci_core_subnet.oci1_oci1-base_private_757CEF5F (oci1/oci1/oci1-base/private) will be created
         + resource "oci_core_subnet" "oci1_oci1-base_private_757CEF5F" {
             + availability_domain        = (known after apply)
             + cidr_block                 = "10.0.1.0/24"
             + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + dhcp_options_id            = (known after apply)
             + display_name               = "private"
             + dns_label                  = "private"
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + ipv6cidr_block             = (known after apply)
             + ipv6cidr_blocks            = (known after apply)
             + ipv6virtual_router_ip      = (known after apply)
             + prohibit_internet_ingress  = true
             + prohibit_public_ip_on_vnic = true
             + route_table_id             = (known after apply)
             + security_list_ids          = (known after apply)
             + state                      = (known after apply)
             + subnet_domain_name         = (known after apply)
             + time_created               = (known after apply)
             + vcn_id                     = (known after apply)
             + virtual_router_ip          = (known after apply)
             + virtual_router_mac         = (known after apply)
           }

         # oci_core_subnet.oci1_oci1-base_public_E80D1048 (oci1/oci1/oci1-base/public) will be created
         + resource "oci_core_subnet" "oci1_oci1-base_public_E80D1048" {
             + availability_domain        = (known after apply)
             + cidr_block                 = "10.0.0.0/24"
             + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + dhcp_options_id            = (known after apply)
cdktf  + display_name               = "public"
             + dns_label                  = "public"
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + ipv6cidr_block             = (known after apply)
             + ipv6cidr_blocks            = (known after apply)
             + ipv6virtual_router_ip      = (known after apply)
             + prohibit_internet_ingress  = false
             + prohibit_public_ip_on_vnic = false
             + route_table_id             = (known after apply)
             + security_list_ids          = (known after apply)
             + state                      = (known after apply)
             + subnet_domain_name         = (known after apply)
             + time_created               = (known after apply)
             + vcn_id                     = (known after apply)
             + virtual_router_ip          = (known after apply)
             + virtual_router_mac         = (known after apply)
           }

         # oci_core_subnet.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private_4162BE1B (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/private) will be created
         + resource "oci_core_subnet" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private_4162BE1B" {
             + availability_domain        = (known after apply)
             + cidr_block                 = "10.0.1.0/24"
             + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + dhcp_options_id            = (known after apply)
             + display_name               = "private"
             + dns_label                  = "private"
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + ipv6cidr_block             = (known after apply)
             + ipv6cidr_blocks            = (known after apply)
             + ipv6virtual_router_ip      = (known after apply)
             + prohibit_internet_ingress  = true
             + prohibit_public_ip_on_vnic = true
             + route_table_id             = (known after apply)
             + security_list_ids          = (known after apply)
             + state                      = (known after apply)
             + subnet_domain_name         = (known after apply)
             + time_created               = (known after apply)
             + vcn_id                     = (known after apply)
             + virtual_router_ip          = (known after apply)
             + virtual_router_mac         = (known after apply)
           }

         # oci_core_subnet.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public_4382CEA5 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/public) will be created
         + resource "oci_core_subnet" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public_4382CEA5" {
             + availability_domain        = (known after apply)
             + cidr_block                 = "10.0.0.0/24"
             + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + dhcp_options_id            = (known after apply)
             + display_name               = "public"
             + dns_label                  = "public"
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + ipv6cidr_block             = (known after apply)
             + ipv6cidr_blocks            = (known after apply)
             + ipv6virtual_router_ip      = (known after apply)
             + prohibit_internet_ingress  = false
             + prohibit_public_ip_on_vnic = false
             + route_table_id             = (known after apply)
             + security_list_ids          = (known after apply)
             + state                      = (known after apply)
             + subnet_domain_name         = (known after apply)
             + time_created               = (known after apply)
             + vcn_id                     = (known after apply)
             + virtual_router_ip          = (known after apply)
             + virtual_router_mac         = (known after apply)
           }

         # oci_core_subnet.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private_173502B2 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/private) will be created
         + resource "oci_core_subnet" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private_173502B2" {
             + availability_domain        = (known after apply)
             + cidr_block                 = "10.0.1.0/24"
cdktf  + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + dhcp_options_id            = (known after apply)
             + display_name               = "private"
             + dns_label                  = "private"
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + ipv6cidr_block             = (known after apply)
             + ipv6cidr_blocks            = (known after apply)
             + ipv6virtual_router_ip      = (known after apply)
             + prohibit_internet_ingress  = true
             + prohibit_public_ip_on_vnic = true
             + route_table_id             = (known after apply)
             + security_list_ids          = (known after apply)
             + state                      = (known after apply)
             + subnet_domain_name         = (known after apply)
             + time_created               = (known after apply)
             + vcn_id                     = (known after apply)
             + virtual_router_ip          = (known after apply)
             + virtual_router_mac         = (known after apply)
           }

         # oci_core_subnet.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public_DF13F306 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/public) will be created
         + resource "oci_core_subnet" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public_DF13F306" {
             + availability_domain        = (known after apply)
             + cidr_block                 = "10.0.0.0/24"
             + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + dhcp_options_id            = (known after apply)
             + display_name               = "public"
             + dns_label                  = "public"
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + ipv6cidr_block             = (known after apply)
             + ipv6cidr_blocks            = (known after apply)
             + ipv6virtual_router_ip      = (known after apply)
             + prohibit_internet_ingress  = false
             + prohibit_public_ip_on_vnic = false
             + route_table_id             = (known after apply)
             + security_list_ids          = (known after apply)
             + state                      = (known after apply)
             + subnet_domain_name         = (known after apply)
             + time_created               = (known after apply)
             + vcn_id                     = (known after apply)
             + virtual_router_ip          = (known after apply)
             + virtual_router_mac         = (known after apply)
           }

         # oci_identity_compartment.oci0_terraform_38B13C88 (oci0/terraform) will be created
         + resource "oci_identity_compartment" "oci0_terraform_38B13C88" {
             + compartment_id = "ocid1.tenancy.oc1..aaaaaaaapcnijruz7rnfderpf6j2f3omp7hdxteh4yets5iw6s7l3w62ksla"
             + defined_tags   = (known after apply)
             + description    = "Compartment for Terraform resources."
             + freeform_tags  = (known after apply)
             + id             = (known after apply)
             + inactive_state = (known after apply)
             + is_accessible  = (known after apply)
             + name           = "terraform"
             + state          = (known after apply)
             + time_created   = (known after apply)
           }

         # oci_identity_compartment.oci1_terraform_7FF23FED (oci1/terraform) will be created
         + resource "oci_identity_compartment" "oci1_terraform_7FF23FED" {
             + compartment_id = "ocid1.tenancy.oc1..aaaaaaaaftae5pyuig4mlbgylovgtqd7a2lbbvq3cswcxmltabgnofyas6la"
             + defined_tags   = (known after apply)
             + description    = "Compartment for Terraform resources."
             + freeform_tags  = (known after apply)
             + id             = (known after apply)
             + inactive_state = (known after apply)
             + is_accessible  = (known after apply)
             + name           = "terraform"
             + state          = (known after apply)
             + time_created   = (known after apply)
           }

         # oci_identity_compartment.oci2_terraform_3F88AD18 (oci2/terraform) will be created
         + resource "oci_identity_compartment" "oci2_terraform_3F88AD18" {
cdktf  + compartment_id = "ocid1.tenancy.oc1..aaaaaaaay647z544mgnl3j5u2txgah67k6yeuqjillnco3ns3h5iuc4vtyfa"
             + defined_tags   = (known after apply)
             + description    = "Compartment for Terraform resources."
             + freeform_tags  = (known after apply)
             + id             = (known after apply)
             + inactive_state = (known after apply)
             + is_accessible  = (known after apply)
             + name           = "terraform"
             + state          = (known after apply)
             + time_created   = (known after apply)
           }

         # random_id.oci1_oci1-vault-tunnel_tunnel_secret_48460AC7 (oci1/oci1/oci1-vault-tunnel/tunnel_secret) will be created
         + resource "random_id" "oci1_oci1-vault-tunnel_tunnel_secret_48460AC7" {
             + b64_std     = (known after apply)
             + b64_url     = (known after apply)
             + byte_length = 35
             + dec         = (known after apply)
             + hex         = (known after apply)
             + id          = (known after apply)
           }

         # random_id.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_secret_2FA2656E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_secret) will be created
         + resource "random_id" "oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_secret_2FA2656E" {
             + b64_std     = (known after apply)
             + b64_url     = (known after apply)
             + byte_length = 35
             + dec         = (known after apply)
             + hex         = (known after apply)
             + id          = (known after apply)
           }

         # random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_secret_C958FD23 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_secret) will be created
         + resource "random_id" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_secret_C958FD23" {
             + b64_std     = (known after apply)
             + b64_url     = (known after apply)
             + byte_length = 35
             + dec         = (known after apply)
             + hex         = (known after apply)
             + id          = (known after apply)
           }

         # random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_secret_B58DB779 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_secret) will be created
         + resource "random_id" "oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_secret_B58DB779" {
             + b64_std     = (known after apply)
             + b64_url     = (known after apply)
             + byte_length = 35
             + dec         = (known after apply)
             + hex         = (known after apply)
             + id          = (known after apply)
           }

         # tailscale_tailnet_key.tailscale_auth_key (tailscale_auth_key) will be created
         + resource "tailscale_tailnet_key" "tailscale_auth_key" {
             + created_at    = (known after apply)
             + ephemeral     = false
             + expires_at    = (known after apply)
             + id            = (known after apply)
             + invalid       = (known after apply)
             + key           = (sensitive value)
             + preauthorized = true
             + reusable      = true
             + tags          = [
                 + "tag:cdktf",
                 + "tag:oci",
                 + "tag:ssh",
               ]
           }

         # module.oci0_oci0-base_vcn_D4433BAC.oci_core_default_security_list.lockdown[0] will be created
         + resource "oci_core_default_security_list" "lockdown" {
             + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + display_name               = (known after apply)
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + manage_default_resource_id = (known after apply)
             + state                      = (known after apply)
             + time_created               = (known after apply)
           }

         # module.oci0_oci0-base_vcn_D4433BAC.oci_core_internet_gateway.ig[0] will be created
         + resource "oci_core_internet_gateway" "ig" {
             + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "internet-gateway"
             + enabled        = true
             + freeform_tags  = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
                 + "terraformed" = "Please do not edit manually"
               }
             + id             = (known after apply)
             + route_table_id = (known after apply)
             + state          = (known after apply)
cdktf  + time_created   = (known after apply)
             + vcn_id         = (known after apply)
           }

         # module.oci0_oci0-base_vcn_D4433BAC.oci_core_route_table.ig[0] will be created
         + resource "oci_core_route_table" "ig" {
             + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "internet-route"
             + freeform_tags  = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
                 + "terraformed" = "Please do not edit manually"
               }
             + id             = (known after apply)
             + state          = (known after apply)
             + time_created   = (known after apply)
             + vcn_id         = (known after apply)

             + route_rules {
                 + cidr_block        = (known after apply)
                 + description       = "Terraformed - Auto-generated at Internet Gateway creation: Internet Gateway as default gateway"
                 + destination       = "0.0.0.0/0"
                 + destination_type  = (known after apply)
                 + network_entity_id = (known after apply)
                 + route_type        = (known after apply)
               }
           }

         # module.oci0_oci0-base_vcn_D4433BAC.oci_core_vcn.vcn will be created
         + resource "oci_core_vcn" "vcn" {
             + byoipv6cidr_blocks               = (known after apply)
             + cidr_block                       = (known after apply)
             + cidr_blocks                      = [
                 + "10.0.0.0/16",
               ]
             + compartment_id                   = (known after apply)
             + default_dhcp_options_id          = (known after apply)
             + default_route_table_id           = (known after apply)
             + default_security_list_id         = (known after apply)
             + defined_tags                     = (known after apply)
             + display_name                     = "terraform"
             + dns_label                        = "oci0"
             + freeform_tags                    = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
                 + "terraformed" = "Please do not edit manually"
               }
             + id                               = (known after apply)
             + ipv6cidr_blocks                  = (known after apply)
             + ipv6private_cidr_blocks          = (known after apply)
             + is_ipv6enabled                   = false
             + is_oracle_gua_allocation_enabled = (known after apply)
             + state                            = (known after apply)
             + time_created                     = (known after apply)
             + vcn_domain_name                  = (known after apply)

             + byoipv6cidr_details (known after apply)
           }

         # module.oci1_oci1-base_vcn_51671EF0.oci_core_default_security_list.lockdown[0] will be created
         + resource "oci_core_default_security_list" "lockdown" {
             + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + display_name               = (known after apply)
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + manage_default_resource_id = (known after apply)
             + state                      = (known after apply)
             + time_created               = (known after apply)
           }

         # module.oci1_oci1-base_vcn_51671EF0.oci_core_internet_gateway.ig[0] will be created
         + resource "oci_core_internet_gateway" "ig" {
             + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "internet-gateway"
             + enabled        = true
             + freeform_tags  = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
                 + "terraformed" = "Please do not edit manually"
               }
             + id             = (known after apply)
             + route_table_id = (known after apply)
             + state          = (known after apply)
             + time_created   = (known after apply)
             + vcn_id         = (known after apply)
           }

         # module.oci1_oci1-base_vcn_51671EF0.oci_core_route_table.ig[0] will be created
         + resource "oci_core_route_table" "ig" {
cdktf  + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "internet-route"
             + freeform_tags  = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
                 + "terraformed" = "Please do not edit manually"
               }
             + id             = (known after apply)
             + state          = (known after apply)
             + time_created   = (known after apply)
             + vcn_id         = (known after apply)

             + route_rules {
                 + cidr_block        = (known after apply)
                 + description       = "Terraformed - Auto-generated at Internet Gateway creation: Internet Gateway as default gateway"
                 + destination       = "0.0.0.0/0"
                 + destination_type  = (known after apply)
                 + network_entity_id = (known after apply)
                 + route_type        = (known after apply)
               }
           }

         # module.oci1_oci1-base_vcn_51671EF0.oci_core_vcn.vcn will be created
         + resource "oci_core_vcn" "vcn" {
             + byoipv6cidr_blocks               = (known after apply)
             + cidr_block                       = (known after apply)
             + cidr_blocks                      = [
                 + "10.0.0.0/16",
               ]
             + compartment_id                   = (known after apply)
             + default_dhcp_options_id          = (known after apply)
             + default_route_table_id           = (known after apply)
             + default_security_list_id         = (known after apply)
             + defined_tags                     = (known after apply)
             + display_name                     = "terraform"
             + dns_label                        = "oci1"
             + freeform_tags                    = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
                 + "terraformed" = "Please do not edit manually"
               }
             + id                               = (known after apply)
             + ipv6cidr_blocks                  = (known after apply)
             + ipv6private_cidr_blocks          = (known after apply)
             + is_ipv6enabled                   = false
             + is_oracle_gua_allocation_enabled = (known after apply)
             + state                            = (known after apply)
             + time_created                     = (known after apply)
             + vcn_domain_name                  = (known after apply)

             + byoipv6cidr_details (known after apply)
           }

         # module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_default_security_list.lockdown[0] will be created
         + resource "oci_core_default_security_list" "lockdown" {
             + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + display_name               = (known after apply)
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + manage_default_resource_id = (known after apply)
             + state                      = (known after apply)
             + time_created               = (known after apply)
           }

         # module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_internet_gateway.ig[0] will be created
         + resource "oci_core_internet_gateway" "ig" {
             + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "internet-gateway"
             + enabled        = true
             + freeform_tags  = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
                 + "terraformed" = "Please do not edit manually"
               }
             + id             = (known after apply)
             + route_table_id = (known after apply)
             + state          = (known after apply)
             + time_created   = (known after apply)
             + vcn_id         = (known after apply)
           }

         # module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_route_table.ig[0] will be created
         + resource "oci_core_route_table" "ig" {
             + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "internet-route"
cdktf  + freeform_tags  = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
                 + "terraformed" = "Please do not edit manually"
               }
             + id             = (known after apply)
             + state          = (known after apply)
             + time_created   = (known after apply)
             + vcn_id         = (known after apply)

             + route_rules {
                 + cidr_block        = (known after apply)
                 + description       = "Terraformed - Auto-generated at Internet Gateway creation: Internet Gateway as default gateway"
                 + destination       = "0.0.0.0/0"
                 + destination_type  = (known after apply)
                 + network_entity_id = (known after apply)
                 + route_type        = (known after apply)
               }
           }

         # module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_vcn.vcn will be created
         + resource "oci_core_vcn" "vcn" {
             + byoipv6cidr_blocks               = (known after apply)
             + cidr_block                       = (known after apply)
             + cidr_blocks                      = [
                 + "10.0.0.0/16",
               ]
             + compartment_id                   = (known after apply)
             + default_dhcp_options_id          = (known after apply)
             + default_route_table_id           = (known after apply)
             + default_security_list_id         = (known after apply)
             + defined_tags                     = (known after apply)
             + display_name                     = "terraform"
             + dns_label                        = "oci2usphoenix1"
             + freeform_tags                    = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
                 + "terraformed" = "Please do not edit manually"
               }
             + id                               = (known after apply)
             + ipv6cidr_blocks                  = (known after apply)
             + ipv6private_cidr_blocks          = (known after apply)
             + is_ipv6enabled                   = false
             + is_oracle_gua_allocation_enabled = (known after apply)
             + state                            = (known after apply)
             + time_created                     = (known after apply)
             + vcn_domain_name                  = (known after apply)

             + byoipv6cidr_details (known after apply)
           }

         # module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_default_security_list.lockdown[0] will be created
         + resource "oci_core_default_security_list" "lockdown" {
             + compartment_id             = (known after apply)
             + defined_tags               = (known after apply)
             + display_name               = (known after apply)
             + freeform_tags              = (known after apply)
             + id                         = (known after apply)
             + manage_default_resource_id = (known after apply)
             + state                      = (known after apply)
             + time_created               = (known after apply)
           }

         # module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_internet_gateway.ig[0] will be created
         + resource "oci_core_internet_gateway" "ig" {
             + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "internet-gateway"
             + enabled        = true
             + freeform_tags  = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
                 + "terraformed" = "Please do not edit manually"
               }
             + id             = (known after apply)
             + route_table_id = (known after apply)
             + state          = (known after apply)
             + time_created   = (known after apply)
             + vcn_id         = (known after apply)
           }

         # module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_route_table.ig[0] will be created
         + resource "oci_core_route_table" "ig" {
             + compartment_id = (known after apply)
             + defined_tags   = (known after apply)
             + display_name   = "internet-route"
             + freeform_tags  = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
cdktf  + "terraformed" = "Please do not edit manually"
               }
             + id             = (known after apply)
             + state          = (known after apply)
             + time_created   = (known after apply)
             + vcn_id         = (known after apply)

             + route_rules {
                 + cidr_block        = (known after apply)
                 + description       = "Terraformed - Auto-generated at Internet Gateway creation: Internet Gateway as default gateway"
                 + destination       = "0.0.0.0/0"
                 + destination_type  = (known after apply)
                 + network_entity_id = (known after apply)
                 + route_type        = (known after apply)
               }
           }

         # module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_vcn.vcn will be created
         + resource "oci_core_vcn" "vcn" {
             + byoipv6cidr_blocks               = (known after apply)
             + cidr_block                       = (known after apply)
             + cidr_blocks                      = [
                 + "10.0.0.0/16",
               ]
             + compartment_id                   = (known after apply)
             + default_dhcp_options_id          = (known after apply)
             + default_route_table_id           = (known after apply)
             + default_security_list_id         = (known after apply)
             + defined_tags                     = (known after apply)
             + display_name                     = "terraform"
             + dns_label                        = "oci2ussanjose1"
             + freeform_tags                    = {
                 + "module"      = "oracle-terraform-modules/vcn/oci"
                 + "terraformed" = "Please do not edit manually"
               }
             + id                               = (known after apply)
             + ipv6cidr_blocks                  = (known after apply)
             + ipv6private_cidr_blocks          = (known after apply)
             + is_ipv6enabled                   = false
             + is_oracle_gua_allocation_enabled = (known after apply)
             + state                            = (known after apply)
             + time_created                     = (known after apply)
             + vcn_domain_name                  = (known after apply)

             + byoipv6cidr_details (known after apply)
           }

       Plan: 77 to add, 0 to change, 0 to destroy.

       Changes to Outputs:
         + oci0_compartment-id_B2E21DF0                                                                   = (known after apply)
         + oci0_compartment-name_F137ABE4                                                                 = "terraform"
         + oci0_oci0-base_private-subnet-dns_label_7DC660C8                                               = "private"
         + oci0_oci0-base_private-subnet-id_F89DF5A3                                                      = (known after apply)
         + oci0_oci0-base_private-subnet-name_15841A41                                                    = "private"
         + oci0_oci0-base_private-subnet-subnet_domain_name_3FE2550C                                      = (known after apply)
         + oci0_oci0-base_public-subnet-dns_label_32471719                                                = "public"
         + oci0_oci0-base_public-subnet-id_9A1A879F                                                       = (known after apply)
         + oci0_oci0-base_public-subnet-name_351090EA                                                     = "public"
         + oci0_oci0-base_public-subnet-subnet_domain_name_46910400                                       = (known after apply)
         + oci0_oci0-base_vcn-dns_label_5BD2D3FC                                                          = "oci0"
         + oci0_oci0-base_vcn-domain_name_38DDC26E                                                        = "oci0"
         + oci0_oci0-base_vcn-id_87BF955B                                                                 = (known after apply)
         + oci0_oci0-base_vcn-name_F14385C6                                                               = "terraform"
         + oci1_compartment-id_6C8E0FD1                                                                   = (known after apply)
cdktf  + oci1_compartment-name_C32368C8                                                                 = "terraform"
         + oci1_oci1-base_private-subnet-dns_label_5617DF08                                               = "private"
         + oci1_oci1-base_private-subnet-id_05823730                                                      = (known after apply)
         + oci1_oci1-base_private-subnet-name_CE12CFFA                                                    = "private"
         + oci1_oci1-base_private-subnet-subnet_domain_name_2A413BB8                                      = (known after apply)
         + oci1_oci1-base_public-subnet-dns_label_188893EF                                                = "public"
         + oci1_oci1-base_public-subnet-id_4C674F6E                                                       = (known after apply)
         + oci1_oci1-base_public-subnet-name_2D463AED                                                     = "public"
         + oci1_oci1-base_public-subnet-subnet_domain_name_B020D888                                       = (known after apply)
         + oci1_oci1-base_vcn-dns_label_DEF24157                                                          = "oci1"
         + oci1_oci1-base_vcn-domain_name_9E902338                                                        = "oci1"
         + oci1_oci1-base_vcn-id_C8BF21A0                                                                 = (known after apply)
         + oci1_oci1-base_vcn-name_209984E2                                                               = "terraform"
         + oci1_oci1-vault-compute_boot-volumes_3DBAA598                                                  = {
             + availability_domain = (known after apply)
             + boot_volumes        = (known after apply)
             + compartment_id      = (known after apply)
             + filter              = [
                 + {
                     + name   = "display_name"
                     + regex  = true
                     + values = [
                         + "vault",
                       ]
                   },
                 + {
                     + name   = "state"
                     + regex  = null
                     + values = [
                         + "AVAILABLE",
                       ]
                   },
               ]
             + id                  = (known after apply)
             + volume_group_id     = null
           }
         + oci1_oci1-vault-compute_instance-boot-volume_9D2E0F07                                          = (known after apply)
         + oci1_oci1-vault-compute_instance-display-name_F6EA6C63                                         = "vault"
         + oci1_oci1-vault-compute_instance-hostname_7D8AAC00                                             = "vault"
         + oci1_oci1-vault-compute_instance-source-details_49B43EF8                                       = {
             + boot_volume_size_in_gbs              = (known after apply)
             + boot_volume_vpus_per_gb              = (known after apply)
             + instance_source_image_filter_details = (known after apply)
             + is_preserve_boot_volume_enabled      = null
             + kms_key_id                           = null
             + source_id                            = (known after apply)
             + source_type                          = (known after apply)
           }
         + oci2_compartment-id_EBEB4B5A                                                                   = (known after apply)
         + oci2_compartment-name_68FE8D8C                                                                 = "terraform"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-dns_label_60224B99                = "private"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-id_3E815125                       = (known after apply)
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-name_35C33192                     = "private"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-subnet_domain_name_E92DE5FC       = (known after apply)
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-dns_label_E59F27FB                 = "public"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-id_2596B2F0                        = (known after apply)
cdktf  + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-name_B8FBE865                      = "public"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-subnet_domain_name_A46C5FF7        = (known after apply)
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-dns_label_01E8A435                           = "oci2usphoenix1"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-domain_name_98E64554                         = "oci2usphoenix1"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-id_2468E7D5                                  = (known after apply)
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-name_CA5B3A39                                = "terraform"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_boot-volumes_0CD39B1D                    = {
             + availability_domain = (known after apply)
             + boot_volumes        = (known after apply)
             + compartment_id      = (known after apply)
             + filter              = [
                 + {
                     + name   = "display_name"
                     + regex  = true
                     + values = [
                         + "cicd",
                       ]
                   },
                 + {
                     + name   = "state"
                     + regex  = null
                     + values = [
                         + "AVAILABLE",
                       ]
                   },
               ]
             + id                  = (known after apply)
             + volume_group_id     = null
           }
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-boot-volume_A567D4B1            = (known after apply)
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-display-name_BC2EAE2A           = "cicd"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-hostname_5405EE68               = "cicd"
         + oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-source-details_FC3F5228         = {
             + boot_volume_size_in_gbs              = (known after apply)
             + boot_volume_vpus_per_gb              = (known after apply)
             + instance_source_image_filter_details = (known after apply)
             + is_preserve_boot_volume_enabled      = null
             + kms_key_id                           = null
             + source_id                            = (known after apply)
             + source_type                          = (known after apply)
           }
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_boot-volumes_21834E5A                    = {
             + availability_domain = (known after apply)
             + boot_volumes        = (known after apply)
             + compartment_id      = (known after apply)
             + filter              = [
                 + {
                     + name   = "display_name"
                     + regex  = true
                     + values = [
                         + "auth",
                       ]
                   },
                 + {
                     + name   = "state"
                     + regex  = null
                     + values = [
                         + "AVAILABLE",
                       ]
                   },
               ]
             + id                  = (known after apply)
             + volume_group_id     = null
           }
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-boot-volume_C87777C0            = (known after apply)
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-display-name_A0476686           = "auth"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-hostname_8249F6C5               = "auth"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-source-details_5E9B35BA         = {
             + boot_volume_size_in_gbs              = (known after apply)
             + boot_volume_vpus_per_gb              = (known after apply)
             + instance_source_image_filter_details = (known after apply)
             + is_preserve_boot_volume_enabled      = null
             + kms_key_id                           = null
             + source_id                            = (known after apply)
             + source_type                          = (known after apply)
           }
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-dns_label_79348ED2                = "private"
cdktf  + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-id_4C672C2B                       = (known after apply)
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-name_F9DCE311                     = "private"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-subnet_domain_name_28EE43F3       = (known after apply)
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-dns_label_E6A0F7BA                 = "public"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-id_899CBFD3                        = (known after apply)
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-name_C2213F6C                      = "public"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-subnet_domain_name_0DD664B2        = (known after apply)
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-dns_label_FBF0A2EB                           = "oci2ussanjose1"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-domain_name_116AD8DF                         = "oci2ussanjose1"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-id_B34A7208                                  = (known after apply)
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-name_D9A0FD65                                = "terraform"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_boot-volumes_8751F307            = {
             + availability_domain = (known after apply)
             + boot_volumes        = (known after apply)
             + compartment_id      = (known after apply)
             + filter              = [
                 + {
                     + name   = "display_name"
                     + regex  = true
                     + values = [
                         + "healthchecks",
                       ]
                   },
                 + {
                     + name   = "state"
                     + regex  = null
                     + values = [
                         + "AVAILABLE",
                       ]
                   },
               ]
             + id                  = (known after apply)
             + volume_group_id     = null
           }
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-boot-volume_8B970EC6    = (known after apply)
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-display-name_03D6715F   = "healthchecks"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-hostname_AA05D714       = "healthchecks"
         + oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-source-details_EB6E9EDD = {
             + boot_volume_size_in_gbs              = (known after apply)
             + boot_volume_vpus_per_gb              = (known after apply)
             + instance_source_image_filter_details = (known after apply)
             + is_preserve_boot_volume_enabled      = null
             + kms_key_id                           = null
             + source_id                            = (known after apply)
             + source_type                          = (known after apply)
           }

       Post-plan Tasks:
cdktf  All tasks completed! 1 passed, 0 failed           (4s elapsed)

       │ Snyk ⸺   Passed
       │ No issues found.
       Severity threshold is set to low.
       │ Details: https://app.snyk.io/org/jon77p/project/0fe83cb2-98ca-4577-b078-fd048f4c1e02/history/1ccf7118-1c57-4e79-8a7a-264a1d233e0f
cdktf  │
       │
       │ Overall Result: Passed

       ------------------------------------------------------------------------
cdktf  ------------------------------------------------------------------------

       Cost Estimation:

       Resources: 0 of 73 estimated
                  $0.0/mo +$0.0

       ------------------------------------------------------------------------
cdktf
cdktf  oci_identity_compartment.oci0_terraform_38B13C88 (oci0/terraform): Creating...
       cloudflare_record.oci1_oci1-vault-tunnel_ingress_record_opconnect_jon77p_xyz_1B7A5737 (oci1/oci1/oci1-vault-tunnel/ingress_record_opconnect_jon77p_xyz): Creating...
       cloudflare_zero_trust_access_application.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_7271D789 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_app): Creating...
cdktf  random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_secret_C958FD23 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_secret): Creating...
       random_id.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_secret_2FA2656E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_secret): Creating...
       random_id.oci1_oci1-vault-tunnel_tunnel_secret_48460AC7 (oci1/oci1/oci1-vault-tunnel/tunnel_secret): Creating...
       random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_secret_B58DB779 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_secret): Creating...
       random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_secret_C958FD23 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_secret): Creation complete after 0s [id=--lICuPVvkH3Fe5y13QPPY-proP34zIKH99hNzGDoJKNN7o]
       random_id.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_secret_2FA2656E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_secret): Creation complete after 0s [id=30WmCshEdTcZU2zuUNEUl-TJUPBNPS6ObnX3P9VWW6z1o8k]
       random_id.oci1_oci1-vault-tunnel_tunnel_secret_48460AC7 (oci1/oci1/oci1-vault-tunnel/tunnel_secret): Creation complete after 0s [id=-NVWV_ZSv9R6CQYpqwvZTqrFgatSaA-k7BKx5ak1jVZJMr4]
       random_id.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_secret_B58DB779 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_secret): Creation complete after 0s [id=Glhvgj-vi6m0TruXboPkYZh_y8HBp3Xf0UCiN8upEIFTBU0]
cdktf  cloudflare_record.oci1_oci1-vault-tunnel_ingress_record_vault_jon77p_xyz_5D7A9265 (oci1/oci1/oci1-vault-tunnel/ingress_record_vault_jon77p_xyz): Creating...
       cloudflare_record.oci1_oci1-vault-tunnel_ssh_app_oci1-vault-tunnel_FE5AB979 (oci1/oci1/oci1-vault-tunnel/ssh_app_oci1-vault-tunnel): Creating...
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_oci2-us-sanjose-1-healthchecks-tunnel_69E906E3 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_app_oci2-us-sanjose-1-healthchecks-tunnel): Creating...
       cloudflare_zero_trust_access_application.oci1_oci1-vault-tunnel_ssh_app_68D668B6 (oci1/oci1/oci1-vault-tunnel/ssh_app): Creating...
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_jon77p_xyz_B4CBE9EA (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ingress_record_healthchecks_jon77p_xyz): Creating...
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_oci2-us-sanjose-1-auth-tunnel_FAA28023 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_oci2-us-sanjose-1-auth-tunnel): Creating...
       tailscale_tailnet_key.tailscale_auth_key (tailscale_auth_key): Creating...
       tailscale_tailnet_key.tailscale_auth_key (tailscale_auth_key): Creation complete after 0s [id=kQU4mHDLv911CNTRL]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_thepi_cloud_6389B44E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ingress_record_healthchecks_thepi_cloud): Creating...
       oci_identity_compartment.oci0_terraform_38B13C88 (oci0/terraform): Creation complete after 1s [id=ocid1.compartment.oc1..aaaaaaaaifb5znbuiwdij3lnc7vunthpdjxpn52f6dwzdwd7vgivsk65q6vq]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ingress_record_auth_jon77p_xyz_3D3EF4C0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ingress_record_auth_jon77p_xyz): Creating...
cdktf  cloudflare_record.oci1_oci1-vault-tunnel_ingress_record_opconnect_jon77p_xyz_1B7A5737 (oci1/oci1/oci1-vault-tunnel/ingress_record_opconnect_jon77p_xyz): Creation complete after 2s [id=dbe9ee99a7364c2884047bba057e83d5]
cdktf  cloudflare_zero_trust_access_application.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_D8A92F3E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app): Creating...
       cloudflare_zero_trust_access_application.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_7271D789 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_app): Creation complete after 2s [id=d53d7997-0893-416f-ab71-3813431b3c82]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_oci2-us-phoenix-1-cicd-tunnel_EDF64A2C (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app_oci2-us-phoenix-1-cicd-tunnel): Creating...
       cloudflare_record.oci1_oci1-vault-tunnel_ssh_app_oci1-vault-tunnel_FE5AB979 (oci1/oci1/oci1-vault-tunnel/ssh_app_oci1-vault-tunnel): Creation complete after 3s [id=70c80ee55b33e3a109439db22918e5a3]
       cloudflare_zero_trust_access_application.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_A26FBCE9 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_app): Creating...
cdktf  cloudflare_record.oci1_oci1-vault-tunnel_ingress_record_vault_jon77p_xyz_5D7A9265 (oci1/oci1/oci1-vault-tunnel/ingress_record_vault_jon77p_xyz): Creation complete after 3s [id=3fe1c8efbb2fdf221b43d065c2262431]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_oci2-us-sanjose-1-auth-tunnel_A298E943 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_app_oci2-us-sanjose-1-auth-tunnel): Creating...
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_app_oci2-us-sanjose-1-healthchecks-tunnel_69E906E3 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_app_oci2-us-sanjose-1-healthchecks-tunnel): Creation complete after 3s [id=ab8b77ec955582b22ce2923b4774c0d6]
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_oci2-us-phoenix-1-cicd-tunnel_53FE648A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_oci2-us-phoenix-1-cicd-tunnel): Creating...
       cloudflare_zero_trust_access_application.oci1_oci1-vault-tunnel_ssh_app_68D668B6 (oci1/oci1/oci1-vault-tunnel/ssh_app): Creation complete after 4s [id=c7f8c997-c490-43d7-820f-140c2b879021]
       cloudflare_zero_trust_tunnel_cloudflared.oci1_oci1-vault-tunnel_tunnel_oci1-vault-tunnel_2066D201 (oci1/oci1/oci1-vault-tunnel/tunnel_oci1-vault-tunnel): Creating...
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_jon77p_xyz_B4CBE9EA (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ingress_record_healthchecks_jon77p_xyz): Creation complete after 4s [id=4a1966a83a11fe44b967d3e5f2a9eda7]
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_oci2-us-sanjose-1-healthchecks-tunnel_36ADB018 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_oci2-us-sanjose-1-healthchecks-tunnel): Creating...
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ingress_record_healthchecks_thepi_cloud_6389B44E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ingress_record_healthchecks_thepi_cloud): Creation complete after 5s [id=eae4e14590f8b9d2578762eda49106ae]
       oci_identity_compartment.oci1_terraform_7FF23FED (oci1/terraform): Creating...
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ingress_record_auth_jon77p_xyz_3D3EF4C0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ingress_record_auth_jon77p_xyz): Creation complete after 5s [id=e515c1251cbce112aca6fd465b42da6d]
       oci_identity_compartment.oci2_terraform_3F88AD18 (oci2/terraform): Creating...
       oci_identity_compartment.oci1_terraform_7FF23FED (oci1/terraform): Creation complete after 1s [id=ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda]
       data.oci_core_vcns.oci0_oci0-base_core_vcn_8F8E2055 (oci0/oci0/oci0-base/core_vcn): Refreshing...
cdktf  data.oci_core_vcns.oci0_oci0-base_core_vcn_8F8E2055 (oci0/oci0/oci0-base/core_vcn): Refresh complete after 0s [id=CoreVcnsDataSource-3604188111]
       cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_certificate_C8A986EF (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_certificate): Creating...
       oci_identity_compartment.oci2_terraform_3F88AD18 (oci2/terraform): Creation complete after 0s [id=ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq]
cdktf  cloudflare_zero_trust_access_policy.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_policy_7BF7147D (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_policy): Creating...
       cloudflare_zero_trust_access_application.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_D8A92F3E (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app): Creation complete after 5s [id=a9ff8f54-0e2f-48eb-a1e2-d90eacd7e555]
       cloudflare_zero_trust_access_policy.oci1_oci1-vault-tunnel_ssh_policy_11AD3224 (oci1/oci1/oci1-vault-tunnel/ssh_policy): Creating...
cdktf  cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_oci2-us-sanjose-1-auth-tunnel_FAA28023 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_oci2-us-sanjose-1-auth-tunnel): Creation complete after 7s [id=1a54b4fc-edea-4531-97f2-34283bbf6091]
       cloudflare_zero_trust_access_short_lived_certificate.oci1_oci1-vault-tunnel_ssh_certificate_66EDB87A (oci1/oci1/oci1-vault-tunnel/ssh_certificate): Creating...
cdktf  cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_app_oci2-us-phoenix-1-cicd-tunnel_EDF64A2C (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_app_oci2-us-phoenix-1-cicd-tunnel): Creation complete after 5s [id=3b372fb9bd02dc6b7084b6d308d6a792]
       module.oci0_oci0-base_vcn_D4433BAC.oci_core_vcn.vcn: Creating...
       cloudflare_zero_trust_access_application.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_A26FBCE9 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_app): Creation complete after 4s [id=1a6105f2-8bbb-4d5e-9484-0e71ee40c4a5]
       data.oci_identity_availability_domain.oci1_oci1-vault-compute_ads_12D6B9C9 (oci1/oci1/oci1-vault-compute/ads): Refreshing...
       data.oci_identity_availability_domain.oci1_oci1-vault-compute_ads_12D6B9C9 (oci1/oci1/oci1-vault-compute/ads): Refresh complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaavi2wyd6rjjffu5nzgb3gjq4thy46k7sgw5ibh7mu5sq5fyie6t5a]
       data.oci_core_vcns.oci1_oci1-base_core_vcn_5A15CF74 (oci1/oci1/oci1-base/core_vcn): Refreshing...
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_app_oci2-us-sanjose-1-auth-tunnel_A298E943 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_app_oci2-us-sanjose-1-auth-tunnel): Creation complete after 5s [id=a186ba9f0472d402330ca9ad3a339fa9]
       data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ads_7BD871F0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ads): Refreshing...
cdktf  data.oci_core_vcns.oci1_oci1-base_core_vcn_5A15CF74 (oci1/oci1/oci1-base/core_vcn): Refresh complete after 1s [id=CoreVcnsDataSource-2346786270]
       data.oci_core_vcns.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_core_vcn_1C9F3188 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/core_vcn): Refreshing...
cdktf  module.oci0_oci0-base_vcn_D4433BAC.oci_core_vcn.vcn: Creation complete after 1s [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaakausufiawvhccj5na6fgukt55idgvuwz6oxuxppchwkucykqkpya]
       data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ads_E0439301 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ads): Refreshing...
       data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ads_7BD871F0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ads): Refresh complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaavi2wyd6rjjffu5nzgb3gjq4thy46k7sgw5ibh7mu5sq5fyie6t5a]
       data.oci_identity_availability_domain.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ads_A38EDF06 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ads): Refreshing...
       cloudflare_zero_trust_access_policy.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_policy_7BF7147D (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_policy): Creation complete after 2s [id=3102b295-0795-49e9-a89a-001fa0d01bd5]
       data.oci_core_vcns.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_core_vcn_FC0CC604 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/core_vcn): Refreshing...
       data.oci_identity_availability_domain.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ads_E0439301 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ads): Refresh complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaavi2wyd6rjjffu5nzgb3gjq4thy46k7sgw5ibh7mu5sq5fyie6t5a]
       data.oci_core_vcns.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_core_vcn_1C9F3188 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/core_vcn): Refresh complete after 0s [id=CoreVcnsDataSource-1699921964]
       cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_certificate_E83230F5 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_certificate): Creating...
       cloudflare_zero_trust_access_policy.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_policy_D05C6E16 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_policy): Creating...
       data.oci_identity_availability_domain.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ads_A38EDF06 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ads): Refresh complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaac7uydq54rcymamzauv5pd23qk2g2vqlrfu5jd3y6i6qxpvvzkf7a]
       module.oci1_oci1-base_vcn_51671EF0.oci_core_vcn.vcn: Creating...
       data.oci_core_vcns.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_core_vcn_FC0CC604 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/core_vcn): Refresh complete after 0s [id=CoreVcnsDataSource-1699921964]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_app_oci2-us-sanjose-1-auth-tunnel_DC6BF9E8 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_app_oci2-us-sanjose-1-auth-tunnel): Creating...
cdktf  cloudflare_zero_trust_access_policy.oci1_oci1-vault-tunnel_ssh_policy_11AD3224 (oci1/oci1/oci1-vault-tunnel/ssh_policy): Creation complete after 2s [id=b159d8b9-8897-491b-8e67-b7aa2579a7c8]
       cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_certificate_9E655C25 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_certificate): Creating...
cdktf  module.oci1_oci1-base_vcn_51671EF0.oci_core_vcn.vcn: Creation complete after 1s [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaaral6dnyazx5js62r7byz5coah7q3ydm5td2tqospnrarqfdladzq]
       cloudflare_zero_trust_access_policy.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_policy_AB9BEA0A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_policy): Creating...
cdktf  cloudflare_zero_trust_access_policy.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_policy_D05C6E16 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_policy): Creation complete after 2s [id=cd363345-2544-44ba-9863-181afcdbafb5]
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_vcn.vcn: Creating...
cdktf  cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_ssh_certificate_C8A986EF (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/ssh_certificate): Creation complete after 4s [id=38b70b4e3d9f21056d9d4cbfba58105226bd25698fc61b12]
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_vcn.vcn: Creating...
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_oci2-us-phoenix-1-cicd-tunnel_53FE648A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_oci2-us-phoenix-1-cicd-tunnel): Creation complete after 7s [id=328602bb-4efd-4a4f-b4e2-337b9f212d41]
       data.oci_core_boot_volumes.oci1_oci1-vault-compute_all_boot_volumes_C357A53D (oci1/oci1/oci1-vault-compute/all_boot_volumes): Refreshing...
       data.oci_core_boot_volumes.oci1_oci1-vault-compute_all_boot_volumes_C357A53D (oci1/oci1/oci1-vault-compute/all_boot_volumes): Refresh complete after 0s [id=CoreBootVolumesDataSource-2062574658]
       module.oci0_oci0-base_vcn_D4433BAC.oci_core_internet_gateway.ig[0]: Creating...
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_vcn.vcn: Creation complete after 1s [id=ocid1.vcn.oc1.phx.amaaaaaavaxvekyarjvfvjrasj7k6wjpgwdszc5hmqlc6ymzzt2tfmpo4f7a]
       module.oci0_oci0-base_vcn_D4433BAC.oci_core_default_security_list.lockdown[0]: Creating...
cdktf  cloudflare_zero_trust_tunnel_cloudflared.oci1_oci1-vault-tunnel_tunnel_oci1-vault-tunnel_2066D201 (oci1/oci1/oci1-vault-tunnel/tunnel_oci1-vault-tunnel): Creation complete after 7s [id=dead9a0a-014b-47d7-b0c1-6e256ad60c3f]
       data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_all_boot_volumes_C3CB241A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/all_boot_volumes): Refreshing...
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_vcn.vcn: Creation complete after 1s [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaavaxvekyalqzun5ifhvhrlao2jyu74eyk5usszmyf3waetjsx4rmq]
cdktf  data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_all_boot_volumes_98671A9E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/all_boot_volumes): Refreshing...
       data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_all_boot_volumes_C3CB241A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/all_boot_volumes): Refresh complete after 0s [id=CoreBootVolumesDataSource-2744709155]
       data.oci_core_boot_volumes.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_all_boot_volumes_0EC61C1F (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/all_boot_volumes): Refreshing...
       module.oci0_oci0-base_vcn_D4433BAC.oci_core_internet_gateway.ig[0]: Creation complete after 1s [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaag2aj3c3enodxesoc34h2grrcop47e4dtgbgazsuzrfgsyxrhk2ca]
       module.oci1_oci1-base_vcn_51671EF0.oci_core_internet_gateway.ig[0]: Creating...
       data.oci_core_boot_volumes.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_all_boot_volumes_98671A9E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/all_boot_volumes): Refresh complete after 0s [id=CoreBootVolumesDataSource-2744709155]
       module.oci1_oci1-base_vcn_51671EF0.oci_core_default_security_list.lockdown[0]: Creating...
       data.oci_core_boot_volumes.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_all_boot_volumes_0EC61C1F (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/all_boot_volumes): Refresh complete after 0s [id=CoreBootVolumesDataSource-2286997786]
       oci_core_security_list.oci0_oci0-base_security_list_3B303AEE (oci0/oci0/oci0-base/security_list): Creating...
       module.oci0_oci0-base_vcn_D4433BAC.oci_core_default_security_list.lockdown[0]: Creation complete after 0s [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaag57fq3pfzgkbochyed4rqyrcddn25s3jpvirj6bbqeotls5f3eya]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_app_oci2-us-phoenix-1-cicd-tunnel_B9119A9A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_app_oci2-us-phoenix-1-cicd-tunnel): Creating...
       cloudflare_zero_trust_access_policy.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_policy_AB9BEA0A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_policy): Creation complete after 2s [id=4ba4f5d5-0356-4d8c-86d2-145159c20112]
       oci_core_security_list.oci1_oci1-base_security_list_86B45958 (oci1/oci1/oci1-base/security_list): Creating...
       oci_core_security_list.oci0_oci0-base_security_list_3B303AEE (oci0/oci0/oci0-base/security_list): Creation complete after 0s [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaawtp6d5c6ozttjuaqwl3mb5nvzxrvgau4axetce7qw5zbodxcwwia]
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_default_security_list.lockdown[0]: Creating...
       cloudflare_zero_trust_tunnel_cloudflared.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_oci2-us-sanjose-1-healthchecks-tunnel_36ADB018 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_oci2-us-sanjose-1-healthchecks-tunnel): Creation complete after 8s [id=491d0111-6836-4515-9bb6-20e0ade12a7c]
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_internet_gateway.ig[0]: Creating...
cdktf  module.oci1_oci1-base_vcn_51671EF0.oci_core_internet_gateway.ig[0]: Creation complete after 1s [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaaityfw6ve3az2wjqpasxnyx66ahlnqtgfgmoizoal5j2whv2g7b4q]
       cloudflare_record.oci1_oci1-vault-tunnel_tunnel_app_oci1-vault-tunnel_C7B9BEDE (oci1/oci1/oci1-vault-tunnel/tunnel_app_oci1-vault-tunnel): Creating...
       module.oci1_oci1-base_vcn_51671EF0.oci_core_default_security_list.lockdown[0]: Creation complete after 1s [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaa4wjsjitbn4ljsaqzm2j5iygvo4f6cc4otdf6l3egoacq3x2tmmva]
cdktf  module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_internet_gateway.ig[0]: Creating...
       oci_core_security_list.oci1_oci1-base_security_list_86B45958 (oci1/oci1/oci1-base/security_list): Creation complete after 1s [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaadp5drabvdrgwngdlrznym57teme2dwq2vz53gxmzedgulyziqxhq]
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_default_security_list.lockdown[0]: Creating...
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_default_security_list.lockdown[0]: Creation complete after 0s [id=ocid1.securitylist.oc1.phx.aaaaaaaaejqniplxid6hmuclowhsl74w6yzv6uu544mnuiwu6v3cdot53daa]
       module.oci0_oci0-base_vcn_D4433BAC.oci_core_route_table.ig[0]: Creating...
       cloudflare_zero_trust_access_short_lived_certificate.oci1_oci1-vault-tunnel_ssh_certificate_66EDB87A (oci1/oci1/oci1-vault-tunnel/ssh_certificate): Creation complete after 5s [id=32a8d6d54964452d82c0dc9a138f6772be92fcd886b6ba7b]
       oci_core_security_list.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_security_list_FC3DADC1 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/security_list): Creating...
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_default_security_list.lockdown[0]: Creation complete after 0s [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaaxtr7mjutnldyymcpypxb664aejeq26kh2vtcubwhhcknurds7ttq]
       oci_core_security_list.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_security_list_26368F93 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/security_list): Creating...
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_internet_gateway.ig[0]: Creation complete after 0s [id=ocid1.internetgateway.oc1.phx.aaaaaaaajxb7st3mq35s4bplypp57xmxkmgpvi6aq5snrce3k77w2jhxuszq]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_app_oci2-us-sanjose-1-healthchecks-tunnel_3877712B (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_app_oci2-us-sanjose-1-healthchecks-tunnel): Creating...
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_app_oci2-us-sanjose-1-auth-tunnel_DC6BF9E8 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_app_oci2-us-sanjose-1-auth-tunnel): Creation complete after 4s [id=465b523b137f5715b1f27f69f00c0c2e]
       cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_ssh_certificate_E83230F5 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/ssh_certificate): Creation complete after 4s [id=566674001f2cafff8c860dd73d1f80db03faf5bd03aba054]
       module.oci1_oci1-base_vcn_51671EF0.oci_core_route_table.ig[0]: Creating...
       module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_route_table.ig[0]: Creating...
       module.oci0_oci0-base_vcn_D4433BAC.oci_core_route_table.ig[0]: Creation complete after 0s [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaax7d4ml5husv43cxsmoayue4vgonjdcn4p5n7zzx7h326bd4ovlhq]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_config_oci2-us-sanjose-1-auth-tunnel): Creating...
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_internet_gateway.ig[0]: Creation complete after 0s [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaayvztzez36b75cwjge7qgldkxvy3vojdqhft5jheopuzbbla4je7q]
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_route_table.ig[0]: Creating...
cdktf  oci_core_security_list.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_security_list_26368F93 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/security_list): Creation complete after 0s [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaaxrc4f4tlkmgbo2s532zsczio676a3cubdfu52xb2gr2nokjp7kva]
cdktf  oci_core_subnet.oci0_oci0-base_public_F5847813 (oci0/oci0/oci0-base/public): Creating...
       oci_core_security_list.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_security_list_FC3DADC1 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/security_list): Creation complete after 1s [id=ocid1.securitylist.oc1.phx.aaaaaaaaztrccu4ldwgkqdfvpso42fpnjgyevkgvmbdtcwauftptyltlmd7q]
       oci_core_subnet.oci0_oci0-base_private_3EAB705B (oci0/oci0/oci0-base/private): Creating...
cdktf  module.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn_576675DA.oci_core_route_table.ig[0]: Creation complete after 1s [id=ocid1.routetable.oc1.phx.aaaaaaaanx5vudvrhnq35ulihzdvl5xcnfuym625xsiffaey6lmthdpqqzta]
       oci_core_subnet.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public_4382CEA5 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/public): Creating...
       module.oci1_oci1-base_vcn_51671EF0.oci_core_route_table.ig[0]: Creation complete after 1s [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaajbzpf4bmxuijiddf4nussdevcyhemgemmwi7gxnow7sjok35kcmq]
cdktf  oci_core_subnet.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private_4162BE1B (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/private): Creating...
       module.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn_13EE3A02.oci_core_route_table.ig[0]: Creation complete after 1s [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaavsf3rv2q3qzztzicekvcvg7akgdoqhkiip447geu3iqq5vl6o2za]
       oci_core_subnet.oci1_oci1-base_public_E80D1048 (oci1/oci1/oci1-base/public): Creating...
       cloudflare_zero_trust_access_short_lived_certificate.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_ssh_certificate_9E655C25 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/ssh_certificate): Creation complete after 4s [id=80e280bba2cfb1c7fb83f0b93853632445d0e5abc01a2963]
       oci_core_subnet.oci1_oci1-base_private_757CEF5F (oci1/oci1/oci1-base/private): Creating...
cdktf  cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_app_oci2-us-phoenix-1-cicd-tunnel_B9119A9A (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_app_oci2-us-phoenix-1-cicd-tunnel): Creation complete after 3s [id=0efa49f54aba657fdc586ce83030efb9]
       oci_core_subnet.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private_173502B2 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/private): Creating...
       cloudflare_record.oci1_oci1-vault-tunnel_tunnel_app_oci1-vault-tunnel_C7B9BEDE (oci1/oci1/oci1-vault-tunnel/tunnel_app_oci1-vault-tunnel): Creation complete after 2s [id=c697ab72be5d2a3779e48cee051c6c9c]
       oci_core_subnet.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public_DF13F306 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/public): Creating...
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_app_oci2-us-sanjose-1-healthchecks-tunnel_3877712B (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_app_oci2-us-sanjose-1-healthchecks-tunnel): Creation complete after 2s [id=6f68342b8a4b1cf42f8aaa74256964fb]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_config_oci2-us-phoenix-1-cicd-tunnel_82FEA1E0 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_config_oci2-us-phoenix-1-cicd-tunnel): Creating...
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-tunnel_tunnel_config_oci2-us-sanjose-1-auth-tunnel_DAA5878E (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-tunnel/tunnel_config_oci2-us-sanjose-1-auth-tunnel): Creation complete after 3s [id=1a54b4fc-edea-4531-97f2-34283bbf6091]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910 (oci1/oci1/oci1-vault-tunnel/tunnel_config_oci1-vault-tunnel): Creating...
cdktf  oci_core_subnet.oci0_oci0-base_public_F5847813 (oci0/oci0/oci0-base/public): Creation complete after 3s [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaam2c6conenj437sda2znq722gq4gxn23v6nvescrmrnivotmj4ugq]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel): Creating...
cdktf  oci_core_subnet.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public_4382CEA5 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/public): Creation complete after 2s [id=ocid1.subnet.oc1.phx.aaaaaaaa4vxbukr52hdm7a3racepsrpfeitz2acuga4qfh2m3i6c7u4vdrna]
       oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance): Creating...
       oci_core_subnet.oci1_oci1-base_public_E80D1048 (oci1/oci1/oci1-base/public): Creation complete after 2s [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatcy2zpk2hatnuh7ud3miikq47ub2qxhcryx7act6anl5m4bv3bea]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Creating...
       oci_core_subnet.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private_4162BE1B (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-base/private): Creation complete after 3s [id=ocid1.subnet.oc1.phx.aaaaaaaadhungsdaobawobgr2aukzcpvxhxnssd2a5fxt2x7qfybmmeyb5hq]
cdktf  oci_core_subnet.oci1_oci1-base_private_757CEF5F (oci1/oci1/oci1-base/private): Creation complete after 3s [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatyttz7qfuzjgq2qsaxcxz25432c2ip2bks5ekrb52ot27zxdxycq]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-tunnel_tunnel_config_oci2-us-phoenix-1-cicd-tunnel_82FEA1E0 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-tunnel/tunnel_config_oci2-us-phoenix-1-cicd-tunnel): Creation complete after 2s [id=328602bb-4efd-4a4f-b4e2-337b9f212d41]
cdktf  oci_core_subnet.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private_173502B2 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/private): Creation complete after 2s [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaagr2ylwvroyg6u2hip5r6uwz3ui3kg4cdg3lk67lkwrci5aun7baq]
       cloudflare_zero_trust_tunnel_cloudflared_config.oci1_oci1-vault-tunnel_tunnel_config_oci1-vault-tunnel_A3D5E910 (oci1/oci1/oci1-vault-tunnel/tunnel_config_oci1-vault-tunnel): Creation complete after 1s [id=dead9a0a-014b-47d7-b0c1-6e256ad60c3f]
       oci_core_subnet.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public_DF13F306 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-base/public): Creation complete after 2s [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaauu5jb3n3oudws7kq6tceavx5xzdtabwmvy6icacqnloshzg5pdoa]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Creating...
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Creating...
       cloudflare_zero_trust_tunnel_cloudflared_config.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-tunnel_tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel_8AE6C470 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-tunnel/tunnel_config_oci2-us-sanjose-1-healthchecks-tunnel): Creation complete after 2s [id=491d0111-6836-4515-9bb6-20e0ade12a7c]
cdktf  oci_core_subnet.oci0_oci0-base_private_3EAB705B (oci0/oci0/oci0-base/private): Creation complete after 4s [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaaixrvhcwutdybcv5njiix5e7otfq67j4puk4ttkdeou44lrntbnzq]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance): Still creating... [10s elapsed]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still creating... [10s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still creating... [10s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still creating... [10s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance): Still creating... [20s elapsed]
       oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still creating... [20s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still creating... [20s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still creating... [20s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance): Creation complete after 26s [id=ocid1.instance.oc1.phx.anyhqljrvaxvekyc6e3gkkswdnywfa66ri6ivolqg63ac7ixyubppj6qc6bq]
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-record_0B972CEE (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-record): Creating...
       cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-record_0B972CEE (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-record): Creation complete after 0s [id=cf3feed6787579ebfe36f4ed4859bfa3]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Still creating... [30s elapsed]
cdktf  oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Still creating... [30s elapsed]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Still creating... [30s elapsed]
cdktf  oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance): Creation complete after 37s [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnycngbnb4ptbk3kwqtiyo2ztkfqenmr4nabb2swlnfloa4a]
       cloudflare_record.oci1_oci1-vault-record_DD9AADE3 (oci1/oci1/oci1-vault-record): Creating...
cdktf  cloudflare_record.oci1_oci1-vault-record_DD9AADE3 (oci1/oci1/oci1-vault-record): Creation complete after 0s [id=39d606a587bae593579a55e11a7ab47e]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance): Creation complete after 37s [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyc77hdvotl26i37pfsdtoqzzubfo7qiysvwykerrxagqua]
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-record): Creating...
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-record): Creation complete after 0s [id=088bc807ead737ed3fa6983fbc7ebfd4]
       oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance): Creation complete after 37s [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekycoxyp7usdgsxlfw5tp63lk7antdgthzyejzquzwniafeq]
cdktf  cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-record): Creating...
       cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-record): Creation complete after 1s [id=63167681b29dd7c53160cea2ad0221b1]
       ╷
       │ Warning: Argument is deprecated
       │
       │   with cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-record),
       │   on cdk.tf.json line 936, in resource.cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-record_515A97A6 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-record):
       │  936:         "value": "${oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_ubuntu_instance_199BCF9A (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-healthchecks-compute/ubuntu_instance).public_ip}",
       │
       │ `value` is deprecated in favour of `content` and will be removed in the
       │ next major release.
       ╵
       ╷
       │ Warning: Argument is deprecated
       │
       │   with cloudflare_record.oci1_oci1-vault-record_DD9AADE3 (oci1/oci1/oci1-vault-record),
       │   on cdk.tf.json line 771, in resource.cloudflare_record.oci1_oci1-vault-record_DD9AADE3 (oci1/oci1/oci1-vault-record):
       │  771:         "value": "${oci_core_instance.oci1_oci1-vault-compute_ubuntu_instance_3E6E0388 (oci1/oci1/oci1-vault-compute/ubuntu_instance).public_ip}",
       │
       │ `value` is deprecated in favour of `content` and will be removed in the
       │ next major release.
       ╵
       ╷
       │ Warning: Argument is deprecated
       │
       │   with cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-record),
       │   on cdk.tf.json line 881, in resource.cloudflare_record.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-record_0CBEF4D0 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-record):
       │  881:         "value": "${oci_core_instance.oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_ubuntu_instance_CFC6FA68 (oci2/oci2-us-sanjose-1/oci2-us-sanjose-1-auth-compute/ubuntu_instance).public_ip}",
       │
       │ `value` is deprecated in favour of `content` and will be removed in the
       │ next major release.
       ╵
       ╷
       │ Warning: Argument is deprecated
       │
       │   with cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-record_0B972CEE (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-record),
       │   on cdk.tf.json line 840, in resource.cloudflare_record.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-record_0B972CEE (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-record):
       │  840:         "value": "${oci_core_instance.oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_ubuntu_instance_665A76B8 (oci2/oci2-us-phoenix-1/oci2-us-phoenix-1-cicd-compute/ubuntu_instance).public_ip}",
       │
       │ `value` is deprecated in favour of `content` and will be removed in the
       │ next major release.
       ╵

       Apply complete! Resources: 77 added, 0 changed, 0 destroyed.

       Outputs:
       oci0_oci0-base_public-subnet-dns_label_32471719 = "public"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-boot-volume_A567D4B1 = "ocid1.bootvolume.oc1.phx.abyhqljrswtabkjhp32h4hl2wvoljmcd2r7bwbis3q75bkjwtpeqlgqgjkhq"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_boot-volumes_21834E5A = {
               availability_domain = "EHXP:US-SANJOSE-1-AD-1"
               boot_volumes        = [
                   {
                       auto_tuned_vpus_per_gb        = null
                       autotune_policies             = []
                       availability_domain           = "EHXP:US-SANJOSE-1-AD-1"
                       backup_policy_id              = null
                       boot_volume_replicas          = []
                       boot_volume_replicas_deletion = false
                       cluster_placement_group_id    = null
                       compartment_id                = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
                       defined_tags                  = {
                           "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                           "Oracle-Tags.CreatedOn" = "2024-07-20T06:25:17.014Z"
                       }
                       display_name                  = "auth (Boot Volume)"
                       freeform_tags                 = {}
                       id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq"
                       image_id                      = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
                       is_auto_tune_enabled          = false
                       is_hydrated                   = true
cdktf  kms_key_id                    = null
                       size_in_gbs                   = "47"
                       size_in_mbs                   = "47694"
                       source_details                = []
                       state                         = "AVAILABLE"
                       system_tags                   = {
                           "orcl-cloud.free-tier-retained" = "true"
                       }
                       time_created                  = "2024-07-20 06:25:20.152 +0000 UTC"
                       volume_group_id               = null
                       vpus_per_gb                   = "10"
                   },
               ]
               compartment_id      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
               filter              = [
                   {
                       name   = "display_name"
                       regex  = true
                       values = [
                           "auth",
                       ]
                   },
                   {
                       name   = "state"
                       regex  = false
                       values = [
                           "AVAILABLE",
                       ]
                   },
               ]
               id                  = "CoreBootVolumesDataSource-2744709155"
           }
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-display-name_03D6715F = "healthchecks"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-source-details_EB6E9EDD = {
               boot_volume_size_in_gbs              = null
               boot_volume_vpus_per_gb              = null
               instance_source_image_filter_details = []
               is_preserve_boot_volume_enabled      = false
               kms_key_id                           = null
               source_id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq"
               source_type                          = "bootVolume"
           }
       oci0_compartment-name_F137ABE4 = "terraform"
       oci0_oci0-base_vcn-domain_name_38DDC26E = "oci0"
       oci2_compartment-id_EBEB4B5A = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-id_2596B2F0 = "ocid1.subnet.oc1.phx.aaaaaaaa4vxbukr52hdm7a3racepsrpfeitz2acuga4qfh2m3i6c7u4vdrna"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-hostname_AA05D714 = "healthchecks"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-id_3E815125 = "ocid1.subnet.oc1.phx.aaaaaaaadhungsdaobawobgr2aukzcpvxhxnssd2a5fxt2x7qfybmmeyb5hq"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-name_B8FBE865 = "public"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-dns_label_01E8A435 = "oci2usphoenix1"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-source-details_FC3F5228 = {
               boot_volume_size_in_gbs              = null
               boot_volume_vpus_per_gb              = null
               instance_source_image_filter_details = []
               is_preserve_boot_volume_enabled      = false
               kms_key_id                           = null
               source_id                            = "ocid1.bootvolume.oc1.phx.abyhqljrswtabkjhp32h4hl2wvoljmcd2r7bwbis3q75bkjwtpeqlgqgjkhq"
               source_type                          = "bootVolume"
           }
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-name_F9DCE311 = "private"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-name_C2213F6C = "public"
       oci1_compartment-name_C32368C8 = "terraform"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-id_2468E7D5 = "ocid1.vcn.oc1.phx.amaaaaaavaxvekyarjvfvjrasj7k6wjpgwdszc5hmqlc6ymzzt2tfmpo4f7a"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-subnet_domain_name_0DD664B2 = "public.oci2ussanjose1.oraclevcn.com"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-domain_name_116AD8DF = "oci2ussanjose1"
       oci0_compartment-id_B2E21DF0 = "ocid1.compartment.oc1..aaaaaaaaifb5znbuiwdij3lnc7vunthpdjxpn52f6dwzdwd7vgivsk65q6vq"
       oci0_oci0-base_vcn-name_F14385C6 = "terraform"
cdktf  oci1_oci1-base_private-subnet-id_05823730 = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatyttz7qfuzjgq2qsaxcxz25432c2ip2bks5ekrb52ot27zxdxycq"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-source-details_5E9B35BA = {
               boot_volume_size_in_gbs              = null
               boot_volume_vpus_per_gb              = null
               instance_source_image_filter_details = []
               is_preserve_boot_volume_enabled      = false
               kms_key_id                           = null
               source_id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq"
               source_type                          = "bootVolume"
           }
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-id_B34A7208 = "ocid1.vcn.oc1.us-sanjose-1.amaaaaaavaxvekyalqzun5ifhvhrlao2jyu74eyk5usszmyf3waetjsx4rmq"
       oci1_oci1-base_private-subnet-subnet_domain_name_2A413BB8 = "private.oci1.oraclevcn.com"
       oci1_oci1-base_public-subnet-id_4C674F6E = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatcy2zpk2hatnuh7ud3miikq47ub2qxhcryx7act6anl5m4bv3bea"
       oci1_oci1-base_vcn-domain_name_9E902338 = "oci1"
       oci1_oci1-vault-compute_boot-volumes_3DBAA598 = {
               availability_domain = "JFCW:US-SANJOSE-1-AD-1"
               boot_volumes        = [
                   {
                       auto_tuned_vpus_per_gb        = null
                       autotune_policies             = []
                       availability_domain           = "JFCW:US-SANJOSE-1-AD-1"
                       backup_policy_id              = null
                       boot_volume_replicas          = []
                       boot_volume_replicas_deletion = false
                       cluster_placement_group_id    = null
                       compartment_id                = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda"
                       defined_tags                  = {
                           "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
                           "Oracle-Tags.CreatedOn" = "2024-07-21T00:38:40.904Z"
                       }
                       display_name                  = "vault (Boot Volume)"
                       freeform_tags                 = {}
                       id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljr4ujc63c3adksrrta4ll3ux32tqel7j4tflolazie4qtkfpw4z4pa"
                       image_id                      = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
                       is_auto_tune_enabled          = false
                       is_hydrated                   = true
                       kms_key_id                    = null
                       size_in_gbs                   = "47"
                       size_in_mbs                   = "47694"
                       source_details                = []
                       state                         = "AVAILABLE"
                       system_tags                   = {
                           "orcl-cloud.free-tier-retained" = "true"
                       }
                       time_created                  = "2024-07-21 00:38:43.285 +0000 UTC"
                       volume_group_id               = null
                       vpus_per_gb                   = "10"
                   },
               ]
               compartment_id      = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda"
               filter              = [
                   {
                       name   = "display_name"
                       regex  = true
                       values = [
                           "vault",
                       ]
                   },
                   {
                       name   = "state"
                       regex  = false
                       values = [
                           "AVAILABLE",
                       ]
                   },
               ]
               id                  = "CoreBootVolumesDataSource-2062574658"
           }
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-dns_label_E59F27FB = "public"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_boot-volumes_0CD39B1D = {
               availability_domain = "EHXP:PHX-AD-1"
               boot_volumes        = [
                   {
                       auto_tuned_vpus_per_gb        = null
                       autotune_policies             = []
cdktf  availability_domain           = "EHXP:PHX-AD-1"
                       backup_policy_id              = null
                       boot_volume_replicas          = []
                       boot_volume_replicas_deletion = false
                       cluster_placement_group_id    = null
                       compartment_id                = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
                       defined_tags                  = {
                           "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                           "Oracle-Tags.CreatedOn" = "2024-07-20T06:48:11.544Z"
                       }
                       display_name                  = "cicd (Boot Volume)"
                       freeform_tags                 = {}
                       id                            = "ocid1.bootvolume.oc1.phx.abyhqljrswtabkjhp32h4hl2wvoljmcd2r7bwbis3q75bkjwtpeqlgqgjkhq"
                       image_id                      = "ocid1.image.oc1.phx.aaaaaaaahnj5t3jk6za5prnsz3ikp35kjxfbqagxmhbtwbhirmnoghpjukhq"
                       is_auto_tune_enabled          = false
                       is_hydrated                   = true
                       kms_key_id                    = null
                       size_in_gbs                   = "47"
                       size_in_mbs                   = "47694"
                       source_details                = []
                       state                         = "AVAILABLE"
                       system_tags                   = {}
                       time_created                  = "2024-07-20 06:48:14.886 +0000 UTC"
                       volume_group_id               = null
                       vpus_per_gb                   = "10"
                   },
               ]
               compartment_id      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
               filter              = [
                   {
                       name   = "display_name"
                       regex  = true
                       values = [
                           "cicd",
                       ]
                   },
                   {
                       name   = "state"
                       regex  = false
                       values = [
                           "AVAILABLE",
                       ]
                   },
               ]
               id                  = "CoreBootVolumesDataSource-2286997786"
           }
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-hostname_5405EE68 = "cicd"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_boot-volumes_8751F307 = {
               availability_domain = "EHXP:US-SANJOSE-1-AD-1"
               boot_volumes        = [
                   {
                       auto_tuned_vpus_per_gb        = null
                       autotune_policies             = []
                       availability_domain           = "EHXP:US-SANJOSE-1-AD-1"
                       backup_policy_id              = null
                       boot_volume_replicas          = []
                       boot_volume_replicas_deletion = false
                       cluster_placement_group_id    = null
                       compartment_id                = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
                       defined_tags                  = {
                           "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
                           "Oracle-Tags.CreatedOn" = "2024-07-20T06:25:16.626Z"
                       }
                       display_name                  = "healthchecks (Boot Volume)"
                       freeform_tags                 = {}
                       id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq"
                       image_id                      = "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiapmujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa"
                       is_auto_tune_enabled          = false
                       is_hydrated                   = true
                       kms_key_id                    = null
                       size_in_gbs                   = "47"
                       size_in_mbs                   = "47694"
                       source_details                = []
cdktf  state                         = "AVAILABLE"
                       system_tags                   = {
                           "orcl-cloud.free-tier-retained" = "true"
                       }
                       time_created                  = "2024-07-20 06:25:20.141 +0000 UTC"
                       volume_group_id               = null
                       vpus_per_gb                   = "10"
                   },
               ]
               compartment_id      = "ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq"
               filter              = [
                   {
                       name   = "display_name"
                       regex  = true
                       values = [
                           "healthchecks",
                       ]
                   },
                   {
                       name   = "state"
                       regex  = false
                       values = [
                           "AVAILABLE",
                       ]
                   },
               ]
               id                  = "CoreBootVolumesDataSource-2744709155"
           }
       oci0_oci0-base_vcn-id_87BF955B = "ocid1.vcn.oc1.us-sanjose-1.amaaaaaakausufiawvhccj5na6fgukt55idgvuwz6oxuxppchwkucykqkpya"
       oci1_oci1-base_private-subnet-dns_label_5617DF08 = "private"
       oci1_oci1-base_vcn-name_209984E2 = "terraform"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-dns_label_60224B99 = "private"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-hostname_8249F6C5 = "auth"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-dns_label_E6A0F7BA = "public"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-healthchecks-compute_instance-boot-volume_8B970EC6 = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq"
       oci0_oci0-base_public-subnet-id_9A1A879F = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaam2c6conenj437sda2znq722gq4gxn23v6nvescrmrnivotmj4ugq"
       oci1_oci1-base_public-subnet-subnet_domain_name_B020D888 = "public.oci1.oraclevcn.com"
       oci1_oci1-vault-compute_instance-source-details_49B43EF8 = {
               boot_volume_size_in_gbs              = null
               boot_volume_vpus_per_gb              = null
               instance_source_image_filter_details = []
               is_preserve_boot_volume_enabled      = false
               kms_key_id                           = null
               source_id                            = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljr4ujc63c3adksrrta4ll3ux32tqel7j4tflolazie4qtkfpw4z4pa"
               source_type                          = "bootVolume"
           }
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_public-subnet-subnet_domain_name_A46C5FF7 = "public.oci2usphoenix1.oraclevcn.com"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-name_D9A0FD65 = "terraform"
       oci0_oci0-base_private-subnet-dns_label_7DC660C8 = "private"
       oci1_compartment-id_6C8E0FD1 = "ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda"
       oci1_oci1-base_public-subnet-name_2D463AED = "public"
       oci1_oci1-base_vcn-dns_label_DEF24157 = "oci1"
       oci1_oci1-vault-compute_instance-display-name_F6EA6C63 = "vault"
       oci1_oci1-vault-compute_instance-hostname_7D8AAC00 = "vault"
       oci2_compartment-name_68FE8D8C = "terraform"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-domain_name_98E64554 = "oci2usphoenix1"
       oci0_oci0-base_private-subnet-id_F89DF5A3 = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaaixrvhcwutdybcv5njiix5e7otfq67j4puk4ttkdeou44lrntbnzq"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-subnet_domain_name_28EE43F3 = "private.oci2ussanjose1.oraclevcn.com"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_public-subnet-id_899CBFD3 = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaauu5jb3n3oudws7kq6tceavx5xzdtabwmvy6icacqnloshzg5pdoa"
       oci0_oci0-base_private-subnet-subnet_domain_name_3FE2550C = "private.oci0.oraclevcn.com"
       oci1_oci1-base_public-subnet-dns_label_188893EF = "public"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-subnet_domain_name_E92DE5FC = "private.oci2usphoenix1.oraclevcn.com"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_vcn-name_CA5B3A39 = "terraform"
cdktf  oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-cicd-compute_instance-display-name_BC2EAE2A = "cicd"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-id_4C672C2B = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaagr2ylwvroyg6u2hip5r6uwz3ui3kg4cdg3lk67lkwrci5aun7baq"
       oci0_oci0-base_private-subnet-name_15841A41 = "private"
       oci0_oci0-base_public-subnet-subnet_domain_name_46910400 = "public.oci0.oraclevcn.com"
       oci1_oci1-base_vcn-id_C8BF21A0 = "ocid1.vcn.oc1.us-sanjose-1.amaaaaaaral6dnyazx5js62r7byz5coah7q3ydm5td2tqospnrarqfdladzq"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-display-name_A0476686 = "auth"
       oci0_oci0-base_public-subnet-name_351090EA = "public"
       oci1_oci1-base_private-subnet-name_CE12CFFA = "private"
       oci2_oci2-us-phoenix-1_oci2-us-phoenix-1-base_private-subnet-name_35C33192 = "private"
       oci0_oci0-base_vcn-dns_label_5BD2D3FC = "oci0"
       oci1_oci1-vault-compute_instance-boot-volume_9D2E0F07 = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljr4ujc63c3adksrrta4ll3ux32tqel7j4tflolazie4qtkfpw4z4pa"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-auth-compute_instance-boot-volume_C87777C0 = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_private-subnet-dns_label_79348ED2 = "private"
       oci2_oci2-us-sanjose-1_oci2-us-sanjose-1-base_vcn-dns_label_FBF0A2EB = "oci2ussanjose1"

  cdktf
    oci0
      compartment-id = ocid1.compartment.oc1..aaaaaaaaifb5znbuiwdij3lnc7vunthpdj
      xpn52f6dwzdwd7vgivsk65q6vq
      compartment-name = terraform
        oci0
              oci0-base
                    private-subnet-dns_label = private
                    private-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaaix
                    rvhcwutdybcv5njiix5e7otfq67j4puk4ttkdeou44lrntbnzq
                    private-subnet-name = private
                    private-subnet-subnet_domain_name =
                    private.oci0.oraclevcn.com
                    public-subnet-dns_label = public
                    public-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaam2c
                    6conenj437sda2znq722gq4gxn23v6nvescrmrnivotmj4ugq
                    public-subnet-name = public
                    public-subnet-subnet_domain_name = public.oci0.oraclevcn.com
                    vcn-dns_label = oci0
                    vcn-domain_name = oci0
                    vcn-id = ocid1.vcn.oc1.us-sanjose-1.amaaaaaakausufiawvhccj5n
                    a6fgukt55idgvuwz6oxuxppchwkucykqkpya
                    vcn-name = terraform



    oci1
      compartment-id = ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnkto
      xgy7n47xekua6k2aeycrumdpda
      compartment-name = terraform
        oci1
              oci1-base
                    private-subnet-dns_label = private
                    private-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaaty
                    ttz7qfuzjgq2qsaxcxz25432c2ip2bks5ekrb52ot27zxdxycq
                    private-subnet-name = private
                    private-subnet-subnet_domain_name =
                    private.oci1.oraclevcn.com
                    public-subnet-dns_label = public
                    public-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaatcy
                    2zpk2hatnuh7ud3miikq47ub2qxhcryx7act6anl5m4bv3bea
                    public-subnet-name = public
                    public-subnet-subnet_domain_name = public.oci1.oraclevcn.com
                    vcn-dns_label = oci1
                    vcn-domain_name = oci1
                    vcn-id = ocid1.vcn.oc1.us-sanjose-1.amaaaaaaral6dnyazx5js62r
                    7byz5coah7q3ydm5td2tqospnrarqfdladzq
                    vcn-name = terraform

              oci1-vault-compute
                    boot-volumes = {
                      "availability_domain": "JFCW:US-SANJOSE-1-AD-1",
                      "boot_volumes": [
                        {
                          "auto_tuned_vpus_per_gb": "",
                          "autotune_policies": [],
                          "availability_domain": "JFCW:US-SANJOSE-1-AD-1",
                          "backup_policy_id": "",
                          "boot_volume_replicas": [],
                          "boot_volume_replicas_deletion": false,
                          "cluster_placement_group_id": "",
                          "compartment_id": "ocid1.compartment.oc1..aaaaaaaabmom
                    hkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda",
                          "defined_tags": {
                            "Oracle-Tags.CreatedBy":
                    "oracleidentitycloudservice/jon77.p@gmail.com",
                            "Oracle-Tags.CreatedOn": "2024-07-21T00:38:40.904Z"
                          },
                          "display_name": "vault (Boot Volume)",
                          "freeform_tags": {},
                          "id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljr4ujc6
                    3c3adksrrta4ll3ux32tqel7j4tflolazie4qtkfpw4z4pa",
                          "image_id": "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiap
                    mujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa",
                          "is_auto_tune_enabled": false,
                          "is_hydrated": true,
                          "kms_key_id": "",
                          "size_in_gbs": "47",
                          "size_in_mbs": "47694",
                          "source_details": [],
                          "state": "AVAILABLE",
                          "system_tags": {
                            "orcl-cloud.free-tier-retained": "true"
                          },
                          "time_created": "2024-07-21 00:38:43.285 +0000 UTC",
                          "volume_group_id": "",
                          "vpus_per_gb": "10"
                        }
                      ],
                      "compartment_id": "ocid1.compartment.oc1..aaaaaaaabmomhktt
                    vm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda",
                      "filter": [
                        {
                          "name": "display_name",
                          "regex": true,
                          "values": [
                            "vault"
                          ]
                        },
                        {
                          "name": "state",
                          "regex": false,
                          "values": [
                            "AVAILABLE"
                          ]
                        }
                      ],
                      "id": "CoreBootVolumesDataSource-2062574658",
                      "volume_group_id": null
                    }
                    instance-boot-volume = ocid1.bootvolume.oc1.us-sanjose-1.abz
                    wuljr4ujc63c3adksrrta4ll3ux32tqel7j4tflolazie4qtkfpw4z4pa
                    instance-display-name = vault
                    instance-hostname = vault
                    instance-source-details = {
                      "boot_volume_size_in_gbs": "",
                      "boot_volume_vpus_per_gb": "",
                      "instance_source_image_filter_details": [],
                      "is_preserve_boot_volume_enabled": false,
                      "kms_key_id": "",
                      "source_id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljr4u
                    jc63c3adksrrta4ll3ux32tqel7j4tflolazie4qtkfpw4z4pa",
                      "source_type": "bootVolume"
                    }



    oci2
      compartment-id = ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnk
      mww62yhftzhyh5k7qncv77x2eq
      compartment-name = terraform
        oci2-us-phoenix-1
              oci2-us-phoenix-1-base
                    private-subnet-dns_label = private
                    private-subnet-id = ocid1.subnet.oc1.phx.aaaaaaaadhungsdaoba
                    wobgr2aukzcpvxhxnssd2a5fxt2x7qfybmmeyb5hq
                    private-subnet-name = private
                    private-subnet-subnet_domain_name =
                    private.oci2usphoenix1.oraclevcn.com
                    public-subnet-dns_label = public
                    public-subnet-id = ocid1.subnet.oc1.phx.aaaaaaaa4vxbukr52hdm
                    7a3racepsrpfeitz2acuga4qfh2m3i6c7u4vdrna
                    public-subnet-name = public
                    public-subnet-subnet_domain_name =
                    public.oci2usphoenix1.oraclevcn.com
                    vcn-dns_label = oci2usphoenix1
                    vcn-domain_name = oci2usphoenix1
                    vcn-id = ocid1.vcn.oc1.phx.amaaaaaavaxvekyarjvfvjrasj7k6wjpg
                    wdszc5hmqlc6ymzzt2tfmpo4f7a
                    vcn-name = terraform

              oci2-us-phoenix-1-cicd-compute
                    boot-volumes = {
                      "availability_domain": "EHXP:PHX-AD-1",
                      "boot_volumes": [
                        {
                          "auto_tuned_vpus_per_gb": "",
                          "autotune_policies": [],
                          "availability_domain": "EHXP:PHX-AD-1",
                          "backup_policy_id": "",
                          "boot_volume_replicas": [],
                          "boot_volume_replicas_deletion": false,
                          "cluster_placement_group_id": "",
                          "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi
                    4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                          "defined_tags": {
                            "Oracle-Tags.CreatedBy":
                    "oracleidentitycloudservice/jon7.7.p@gmail.com",
                            "Oracle-Tags.CreatedOn": "2024-07-20T06:48:11.544Z"
                          },
                          "display_name": "cicd (Boot Volume)",
                          "freeform_tags": {},
                          "id": "ocid1.bootvolume.oc1.phx.abyhqljrswtabkjhp32h4h
                    l2wvoljmcd2r7bwbis3q75bkjwtpeqlgqgjkhq",
                          "image_id": "ocid1.image.oc1.phx.aaaaaaaahnj5t3jk6za5p
                    rnsz3ikp35kjxfbqagxmhbtwbhirmnoghpjukhq",
                          "is_auto_tune_enabled": false,
                          "is_hydrated": true,
                          "kms_key_id": "",
                          "size_in_gbs": "47",
                          "size_in_mbs": "47694",
                          "source_details": [],
                          "state": "AVAILABLE",
                          "system_tags": {},
                          "time_created": "2024-07-20 06:48:14.886 +0000 UTC",
                          "volume_group_id": "",
                          "vpus_per_gb": "10"
                        }
                      ],
                      "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi4uoh
                    tc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                      "filter": [
                        {
                          "name": "display_name",
                          "regex": true,
                          "values": [
                            "cicd"
                          ]
                        },
                        {
                          "name": "state",
                          "regex": false,
                          "values": [
                            "AVAILABLE"
                          ]
                        }
                      ],
                      "id": "CoreBootVolumesDataSource-2286997786",
                      "volume_group_id": null
                    }
                    instance-boot-volume = ocid1.bootvolume.oc1.phx.abyhqljrswta
                    bkjhp32h4hl2wvoljmcd2r7bwbis3q75bkjwtpeqlgqgjkhq
                    instance-display-name = cicd
                    instance-hostname = cicd
                    instance-source-details = {
                      "boot_volume_size_in_gbs": "",
                      "boot_volume_vpus_per_gb": "",
                      "instance_source_image_filter_details": [],
                      "is_preserve_boot_volume_enabled": false,
                      "kms_key_id": "",
                      "source_id": "ocid1.bootvolume.oc1.phx.abyhqljrswtabkjhp32
                    h4hl2wvoljmcd2r7bwbis3q75bkjwtpeqlgqgjkhq",
                      "source_type": "bootVolume"
                    }


        oci2-us-sanjose-1
              oci2-us-sanjose-1-auth-compute
                    boot-volumes = {
                      "availability_domain": "EHXP:US-SANJOSE-1-AD-1",
                      "boot_volumes": [
                        {
                          "auto_tuned_vpus_per_gb": "",
                          "autotune_policies": [],
                          "availability_domain": "EHXP:US-SANJOSE-1-AD-1",
                          "backup_policy_id": "",
                          "boot_volume_replicas": [],
                          "boot_volume_replicas_deletion": false,
                          "cluster_placement_group_id": "",
                          "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi
                    4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                          "defined_tags": {
                            "Oracle-Tags.CreatedBy":
                    "oracleidentitycloudservice/jon7.7.p@gmail.com",
                            "Oracle-Tags.CreatedOn": "2024-07-20T06:25:17.014Z"
                          },
                          "display_name": "auth (Boot Volume)",
                          "freeform_tags": {},
                          "id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk3em
                    tljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq",
                          "image_id": "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiap
                    mujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa",
                          "is_auto_tune_enabled": false,
                          "is_hydrated": true,
                          "kms_key_id": "",
                          "size_in_gbs": "47",
                          "size_in_mbs": "47694",
                          "source_details": [],
                          "state": "AVAILABLE",
                          "system_tags": {
                            "orcl-cloud.free-tier-retained": "true"
                          },
                          "time_created": "2024-07-20 06:25:20.152 +0000 UTC",
                          "volume_group_id": "",
                          "vpus_per_gb": "10"
                        }
                      ],
                      "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi4uoh
                    tc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                      "filter": [
                        {
                          "name": "display_name",
                          "regex": true,
                          "values": [
                            "auth"
                          ]
                        },
                        {
                          "name": "state",
                          "regex": false,
                          "values": [
                            "AVAILABLE"
                          ]
                        }
                      ],
                      "id": "CoreBootVolumesDataSource-2744709155",
                      "volume_group_id": null
                    }
                    instance-boot-volume = ocid1.bootvolume.oc1.us-sanjose-1.abz
                    wuljrmk3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq
                    instance-display-name = auth
                    instance-hostname = auth
                    instance-source-details = {
                      "boot_volume_size_in_gbs": "",
                      "boot_volume_vpus_per_gb": "",
                      "instance_source_image_filter_details": [],
                      "is_preserve_boot_volume_enabled": false,
                      "kms_key_id": "",
                      "source_id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrmk
                    3emtljwa6jgrnkuii67iy47npgi77x7fqrmhkpjyhg3zqvpkaq",
                      "source_type": "bootVolume"
                    }

              oci2-us-sanjose-1-base
                    private-subnet-dns_label = private
                    private-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaagr
                    2ylwvroyg6u2hip5r6uwz3ui3kg4cdg3lk67lkwrci5aun7baq
                    private-subnet-name = private
                    private-subnet-subnet_domain_name =
                    private.oci2ussanjose1.oraclevcn.com
                    public-subnet-dns_label = public
                    public-subnet-id = ocid1.subnet.oc1.us-sanjose-1.aaaaaaaauu5
                    jb3n3oudws7kq6tceavx5xzdtabwmvy6icacqnloshzg5pdoa
                    public-subnet-name = public
                    public-subnet-subnet_domain_name =
                    public.oci2ussanjose1.oraclevcn.com
                    vcn-dns_label = oci2ussanjose1
                    vcn-domain_name = oci2ussanjose1
                    vcn-id = ocid1.vcn.oc1.us-sanjose-1.amaaaaaavaxvekyalqzun5if
                    hvhrlao2jyu74eyk5usszmyf3waetjsx4rmq
                    vcn-name = terraform

              oci2-us-sanjose-1-healthchecks-compute
                    boot-volumes = {
                      "availability_domain": "EHXP:US-SANJOSE-1-AD-1",
                      "boot_volumes": [
                        {
                          "auto_tuned_vpus_per_gb": "",
                          "autotune_policies": [],
                          "availability_domain": "EHXP:US-SANJOSE-1-AD-1",
                          "backup_policy_id": "",
                          "boot_volume_replicas": [],
                          "boot_volume_replicas_deletion": false,
                          "cluster_placement_group_id": "",
                          "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi
                    4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                          "defined_tags": {
                            "Oracle-Tags.CreatedBy":
                    "oracleidentitycloudservice/jon7.7.p@gmail.com",
                            "Oracle-Tags.CreatedOn": "2024-07-20T06:25:16.626Z"
                          },
                          "display_name": "healthchecks (Boot Volume)",
                          "freeform_tags": {},
                          "id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4ptu
                    okej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq",
                          "image_id": "ocid1.image.oc1.us-sanjose-1.aaaaaaaajiap
                    mujnlwkmd4qzbuwbo43t7pzhx6jwxo746s5l4iqx5ktmprxa",
                          "is_auto_tune_enabled": false,
                          "is_hydrated": true,
                          "kms_key_id": "",
                          "size_in_gbs": "47",
                          "size_in_mbs": "47694",
                          "source_details": [],
                          "state": "AVAILABLE",
                          "system_tags": {
                            "orcl-cloud.free-tier-retained": "true"
                          },
                          "time_created": "2024-07-20 06:25:20.141 +0000 UTC",
                          "volume_group_id": "",
                          "vpus_per_gb": "10"
                        }
                      ],
                      "compartment_id": "ocid1.compartment.oc1..aaaaaaaae3xi4uoh
                    tc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq",
                      "filter": [
                        {
                          "name": "display_name",
                          "regex": true,
                          "values": [
                            "healthchecks"
                          ]
                        },
                        {
                          "name": "state",
                          "regex": false,
                          "values": [
                            "AVAILABLE"
                          ]
                        }
                      ],
                      "id": "CoreBootVolumesDataSource-2744709155",
                      "volume_group_id": null
                    }
                    instance-boot-volume = ocid1.bootvolume.oc1.us-sanjose-1.abz
                    wuljrn4ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq
                    instance-display-name = healthchecks
                    instance-hostname = healthchecks
                    instance-source-details = {
                      "boot_volume_size_in_gbs": "",
                      "boot_volume_vpus_per_gb": "",
                      "instance_source_image_filter_details": [],
                      "is_preserve_boot_volume_enabled": false,
                      "kms_key_id": "",
                      "source_id": "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrn4
                    ptuokej7twbzd4jshjg4icsgm3as6wc6xhofzpnshvfdb4jsfq",
                      "source_type": "bootVolume"
                    }





```

</details>